
{
  "nav.about_forro": "About Forró",
  "nav.about_us": "About Us",
  "nav.events": "Events",
  "nav.rules": "Our Rules",
  "nav.partners": "Partners",
  "nav.contact": "Contact",

  "rules.title": "Our Rules",
  "rules.subtitle": "Guidelines to ensure a safe, respectful, and enjoyable experience for everyone",
  "rules.community_guidelines": "Community Guidelines",
  "rules.community_description": "At DanceEvent, we foster a community based on respect, inclusivity, and shared joy of dance. Our guidelines help maintain a positive environment where everyone feels welcome and safe.",
  
  "rules.respect_consent": "Respect and Consent",
  "rules.respect.item1": "Always ask before dancing with someone and respect their decision if they decline.",
  "rules.respect.item2": "Maintain appropriate physical contact during dances. If you're unsure about a move or hold, ask first.",
  "rules.respect.item3": "Listen to your partner's feedback and adjust accordingly.",
  "rules.respect.item4": "Anyone can end a dance at any time without explanation.",
  "rules.respect.item5": "Report any uncomfortable situations to our staff immediately.",
  
  "rules.floor_etiquette": "Floor Etiquette",
  "rules.floor.item1": "Be aware of your surroundings and other dancers on the floor.",
  "rules.floor.item2": "Adapt your movements to the available space—save larger movements for when the floor is less crowded.",
  "rules.floor.item3": "Follow the general counter-clockwise flow of the dance floor when applicable.",
  "rules.floor.item4": "If a collision occurs, check that everyone is okay and apologize before continuing.",
  "rules.floor.item5": "In crowded conditions, prioritize safety over elaborate movements.",
  
  "rules.inclusivity": "Inclusivity",
  "rules.inclusivity.item1": "We welcome dancers of all backgrounds, identities, ages, and skill levels.",
  "rules.inclusivity.item2": "Experienced dancers are encouraged to dance with beginners and provide supportive guidance.",
  "rules.inclusivity.item3": "Discriminatory language or behavior of any kind will not be tolerated.",
  "rules.inclusivity.item4": "We encourage role-switching and learning both lead and follow positions.",
  "rules.inclusivity.item5": "Be patient and supportive of those who are learning.",
  
  "rules.hygiene": "Personal Hygiene and Attire",
  "rules.hygiene.item1": "Come to events freshly showered and wearing deodorant.",
  "rules.hygiene.item2": "Bring a change of clothes or extra shirts if you tend to perspire heavily.",
  "rules.hygiene.item3": "Wear comfortable, clean clothing appropriate for movement.",
  "rules.hygiene.item4": "Choose footwear that won't damage the dance floor (avoid street shoes with dirt or rubber soles that may mark the floor).",
  "rules.hygiene.item5": "Consider bringing a hand towel for personal use.",
  
  "rules.conduct": "General Conduct",
  "rules.conduct.item1": "Arrive on time for classes and respect the instructor's guidance.",
  "rules.conduct.item2": "Excessive alcohol consumption is discouraged—please drink responsibly.",
  "rules.conduct.item3": "Photography and video at events should be consensual. Ask before taking pictures of others.",
  "rules.conduct.item4": "Support the event by paying the appropriate entry fees.",
  "rules.conduct.item5": "Help build our community by welcoming newcomers and creating a positive atmosphere.",
  
  "rules.violations": "Consequences for Rule Violations",
  "rules.violations_description": "We take these guidelines seriously to ensure everyone's safety and enjoyment. Violations will be addressed as follows:",
  
  "rules.first_occurrence": "First Occurrence:",
  "rules.first_occurrence_description": "A verbal reminder about our community guidelines.",
  
  "rules.second_occurrence": "Second Occurrence:",
  "rules.second_occurrence_description": "A formal warning and potential temporary removal from the current event.",
  
  "rules.serious_violations": "Serious or Repeated Violations:",
  "rules.serious_violations_description": "Suspension from future events or permanent exclusion from our community.",
  
  "rules.immediate_ejection": "Immediate Ejection:",
  "rules.immediate_ejection_description": "Severe violations such as harassment, threatening behavior, or endangering others will result in immediate removal with no refund.",
  
  "rules.reporting": "Reporting Concerns",
  "rules.reporting_description": "If you experience or witness behavior that violates these guidelines, please report it immediately to any staff member or event organizer. You can also contact us directly at:",
  "rules.reporting_email": "Email: safety@danceevent.com",
  "rules.reporting_phone": "Phone: (123) 456-7890",
  "rules.reporting_confidential": "All reports will be handled confidentially, and appropriate action will be taken."
}
