
{
  "nav.about_forro": "O Forró",
  "nav.about_us": "O Nás",
  "nav.events": "Podujatia",
  "nav.rules": "Naše Pravidlá",
  "nav.partners": "Partneri",
  "nav.contact": "Kontakt",

  "rules.title": "Naše Pravidlá",
  "rules.subtitle": "Pokyny na zabezpečenie bezpečného, úctivého a príjemného zážitku pre všetkých",
  "rules.community_guidelines": "Komunitné Pokyny",
  "rules.community_description": "V DanceEvent podporujeme komunitu založenú na rešpekte, inkluzivite a spoločnej radosti z tanca. Naše pokyny pomáhajú udržiavať pozitívne prostredie, kde sa každý cíti vítaný a bezpečný.",
  
  "rules.respect_consent": "Rešpekt a Súhlas",
  "rules.respect.item1": "Vždy sa opýtajte pred tancom s niekým a rešpektujte ich rozhodnutie, ak odmietnu.",
  "rules.respect.item2": "Udržujte vhodný fyzický kontakt počas tancov. Ak si nie ste istí pohybom alebo držaním, najprv sa opýtajte.",
  "rules.respect.item3": "Počúvajte spätnú väzbu vášho partnera a prispôsobte sa.",
  "rules.respect.item4": "Ktokoľvek môže kedykoľvek ukončiť tanec bez vysvetlenia.",
  "rules.respect.item5": "Nahláste akékoľvek nepríjemné situácie nášmu personálu okamžite.",
  
  "rules.floor_etiquette": "Etiketa na Parkete",
  "rules.floor.item1": "Buďte si vedomí svojho okolia a ostatných tanečníkov na parkete.",
  "rules.floor.item2": "Prispôsobte svoje pohyby dostupnému priestoru—väčšie pohyby si nechajte na menej zaplnený parket.",
  "rules.floor.item3": "Dodržiavajte všeobecný tok tanečného parketu proti smeru hodinových ručičiek, keď je to možné.",
  "rules.floor.item4": "Ak dôjde ku kolízii, uistite sa, že sú všetci v poriadku a ospravedlňte sa predtým, než budete pokračovať.",
  "rules.floor.item5": "V preplnených podmienkach uprednostnite bezpečnosť pred zložitými pohybmi.",
  
  "rules.inclusivity": "Inkluzivita",
  "rules.inclusivity.item1": "Vítame tanečníkov všetkých prostredí, identít, veku a úrovní zručností.",
  "rules.inclusivity.item2": "Skúsení tanečníci by mali tancovať so začiatočníkmi a poskytnúť im podporné vedenie.",
  "rules.inclusivity.item3": "Diskriminačný jazyk alebo správanie akéhokoľvek druhu nebude tolerované.",
  "rules.inclusivity.item4": "Podporujeme výmenu rolí a učenie sa vedenia aj sledovania.",
  "rules.inclusivity.item5": "Buďte trpezliví a podporujte tých, ktorí sa učia.",
  
  "rules.hygiene": "Osobná Hygiena a Oblečenie",
  "rules.hygiene.item1": "Príďte na podujatia čerstvo osprchovaní a používajte dezodorant.",
  "rules.hygiene.item2": "Prineste si náhradné oblečenie alebo tričká, ak máte tendenciu sa viac potiť.",
  "rules.hygiene.item3": "Noste pohodlné, čisté oblečenie vhodné na pohyb.",
  "rules.hygiene.item4": "Vyberte si obuv, ktorá nepoškodí tanečný parket (vyhnite sa topánkam z ulice so špinou alebo gumeným podrážkam, ktoré môžu zanechať stopy).",
  "rules.hygiene.item5": "Zvážte priniesť si ručník na osobné použitie.",
  
  "rules.conduct": "Všeobecné Správanie",
  "rules.conduct.item1": "Prichádzajte na hodiny načas a rešpektujte pokyny inštruktora.",
  "rules.conduct.item2": "Nadmerná konzumácia alkoholu sa neodporúča—prosíme, pite zodpovedne.",
  "rules.conduct.item3": "Fotografovanie a natáčanie videí na podujatiach by malo byť konsenzuálne. Opýtajte sa pred fotením iných.",
  "rules.conduct.item4": "Podporujte podujatie zaplatením príslušných vstupných poplatkov.",
  "rules.conduct.item5": "Pomáhajte budovať našu komunitu tým, že privítate nováčikov a vytvárate pozitívnu atmosféru.",
  
  "rules.violations": "Dôsledky za Porušenie Pravidiel",
  "rules.violations_description": "Tieto pokyny berieme vážne, aby sme zabezpečili bezpečnosť a potešenie všetkých. Porušenia budú riešené nasledovne:",
  
  "rules.first_occurrence": "Prvý Výskyt:",
  "rules.first_occurrence_description": "Ústna pripomienka našich komunitných pokynov.",
  
  "rules.second_occurrence": "Druhý Výskyt:",
  "rules.second_occurrence_description": "Formálne upozornenie a potenciálne dočasné odstránenie z aktuálneho podujatia.",
  
  "rules.serious_violations": "Vážne alebo Opakované Porušenia:",
  "rules.serious_violations_description": "Pozastavenie účasti na budúcich podujatiach alebo trvalé vylúčenie z našej komunity.",
  
  "rules.immediate_ejection": "Okamžité Vylúčenie:",
  "rules.immediate_ejection_description": "Vážne porušenia ako obťažovanie, vyhrážanie sa alebo ohrozovanie iných budú mať za následok okamžité odstránenie bez náhrady.",
  
  "rules.reporting": "Nahlasovanie Problémov",
  "rules.reporting_description": "Ak zažijete alebo ste svedkom správania, ktoré porušuje tieto pokyny, nahláste to prosím okamžite ktorémukoľvek členovi personálu alebo organizátorovi podujatia. Môžete nás tiež kontaktovať priamo na:",
  "rules.reporting_email": "Email: safety@danceevent.com",
  "rules.reporting_phone": "Telefón: (123) 456-7890",
  "rules.reporting_confidential": "Všetky hlásenia budú spracované dôverne a budú prijaté príslušné opatrenia.",

  "about_forro.title": "O Forró",
  "about_forro.subtitle": "Objavte bohatú históriu a kultúrny význam tohto krásneho brazílskeho tanca",
  "about_forro.origins_title": "Pôvod Forró",
  "about_forro.origins_p1": "Forró má pôvod v severovýchodnom regióne Brazílie a vyvinul sa do jednej z najobľúbenejších tanečných foriem krajiny. Názov \"forró\" je pravdepodobne odvodený od anglickej frázy \"for all\", odkazujúc na inkluzívnu povahu verejných tancov organizovaných britskými železničnými spoločnosťami pre svojich pracovníkov na začiatku 20. storočia.",
  "about_forro.origins_p2": "Ako hudobný žáner, forró zahŕňa rôzne rytmy vrátane baião, xote a arrasta-pé. Tradičný forró súbor, známy ako trio nordestino, pozostáva z akordeónu (hlavný nástroj), zabumba (typ basového bubna) a kovového trojuholníka.",
  "about_forro.dance_style_title": "Tanečný Štýl",
  "about_forro.dance_style_p1": "Tanec forró sa vyznačuje blízkym objatím a rytmickými pohybmi. Partneri tancujú s prepojenými hruďami, zatiaľ čo ich nohy sa prepletajú v rôznych krokových vzoroch. Tanec siaha od jednoduchých dvojkrokových pohybov až po komplexné sekvencie zahŕňajúce otočky, zákony a hravé improvizácie.",
  "about_forro.dance_style_p2": "Existuje niekoľko štýlov forró tanca, vrátane:",
  "about_forro.dance_style_list_1_name": "Forró pé-de-serra:",
  "about_forro.dance_style_list_1_desc": "Tradičný štýl, charakterizovaný jednoduchými krokmi a blízkym objatím",
  "about_forro.dance_style_list_2_name": "Forró universitário:",
  "about_forro.dance_style_list_2_desc": "Moderný, prepracovanejší štýl populárny medzi vysokoškolskými študentmi",
  "about_forro.dance_style_list_3_name": "Forró eletrônico:",
  "about_forro.dance_style_list_3_desc": "Štýl, ktorý zahŕňa prvky iných tanečných štýlov s elektronickými hudobnými vplyvmi",
  "about_forro.cultural_title": "Kultúrny Význam",
  "about_forro.cultural_p1": "Forró je viac než len tanec; je to vitálna súčasť brazílskej kultúrnej identity. Hudba často rozpráva príbehy vidieckeho života, lásky a ťažkostí severovýchodných ľudí. Počas júnových festivalov (Festas Juninas) sa forró dostáva do popredia, keď sa komunity zhromažďujú, aby oslavovali jedlom, tancom a hudbou.",
  "about_forro.cultural_p2": "Dnes sa forró rozšíril medzinárodne, s oddanými komunitami a festivalmi v Európe, Severnej Amerike a ďalej. Jeho prístupná povaha, radostný rytmus a pocit komunity naďalej priťahujú nových nadšencov po celom svete.",
  "about_forro.key_figures": "Kľúčové Osobnosti Forró",
  "about_forro.key_figure_1_name": "Luiz Gonzaga",
  "about_forro.key_figure_1_desc": "Známy ako \"Kráľ Baião\", popularizoval hudbu forró v celej Brazílii",
  "about_forro.key_figure_2_name": "Dominguinhos",
  "about_forro.key_figure_2_desc": "Známy akordeonista a skladateľ, ktorý modernizoval žáner",
  "about_forro.key_figure_3_name": "Marinês",
  "about_forro.key_figure_3_desc": "\"Kráľovná Forró\", ktorá priniesla ženské hlasy do popredia",
  "about_forro.try_forro": "Chcete Vyskúšať Forró?",
  "about_forro.try_forro_desc": "Pridajte sa k našim týždenným lekciám a zažite radosť z tanca forró!",
  "about_forro.see_schedule": "Pozrite Si Náš Rozvrh"
}
