
{
  "en": {
    "about_forro.title": "About Forró",
    "about_forro.subtitle": "Discover the rich history and cultural significance of this beautiful Brazilian dance",
    
    "about_forro.origins_title": "What is Forró?",
    "about_forro.origins_p1": "Forró is a multifaceted musical genre and cultural phenomenon that emerges from Brazil's Northeast region. It encompasses a variety of rhythms and dances, playing a significant role in Brazilian cultural identity. The term \"Forró\" can refer to:",
    "about_forro.origins_p2": "A musical genre composed of a set of rhythms.\nOne specific rhythm within that genre.\nA form of dance.\nA type of social gathering or party centered around this music and dance.",
    
    "about_forro.dance_style_title": "How Does Forró Look?",
    "about_forro.dance_style_p1": "Forró is not just about the music; it is equally about the dance. The dance is characterized by its cozy, inviting atmosphere, typically involving close partner work. The basic step, known as \"dois pra lá e dois pra cá,\" consists of taking two steps to one side and two to the other, forming a rhythmic pattern that allows for various turns, pauses, and movements.",
    "about_forro.dance_style_p2": "The music often features lively accordion, zabumba (a drum), and triangle, with a focus on rhythm and group participation, making it a communal experience at parties and events.",
    "about_forro.dance_style_list_1_name": "Accordion",
    "about_forro.dance_style_list_1_desc": "– the lead melodic instrument.",
    "about_forro.dance_style_list_2_name": "Zabumba",
    "about_forro.dance_style_list_2_desc": "– a drum that provides a deep, syncopated bass rhythm.",
    "about_forro.dance_style_list_3_name": "Triangle",
    "about_forro.dance_style_list_3_desc": "– adds high-pitched percussive accents.",

    "about_forro.styles_title": "Styles of Forró",
    "about_forro.styles_p1": "Forró encompasses various styles, each with its own unique characteristics and expressions:",

    "about_forro.style_1_name": "Pé de Serra",
    "about_forro.style_1_desc": "This style stays true to traditional roots, characterized by its acoustic instrumentation and strong rhythms. Songs often tell stories of rural life and Brazilian folklore.",
    
    "about_forro.style_2_name": "Forró Universitário",
    "about_forro.style_2_desc": "A modern interpretation that became popular in university settings, blending traditional elements with contemporary influences, and often featuring a more diverse range of instruments and arrangements.",
    
    "about_forro.style_3_name": "Forró Eletrônico",
    "about_forro.style_3_desc": "Emerged in the 1990s, incorporating electronic instruments and beats, making it more accessible to younger audiences. It retains the essence of traditional Forró while aiming for broader appeal in urban settings.",
    
    "about_forro.style_4_name": "Rojão",
    "about_forro.style_4_desc": "A lively and upbeat rhythm that emphasizes a strong, clear beat, often used in dances that involve quick footwork and energetic movements.",
    
    "about_forro.style_5_name": "Xaxado",
    "about_forro.style_5_desc": "This dance includes distinct hip movements and emphasizes rhythm, often associated with the cangaço (bandit culture) where men and women dance proudly, showcasing their strength and elegance.",
    
    "about_forro.style_6_name": "Arrasta-Pé",
    "about_forro.style_6_desc": "A festive dance style celebrated during forró parties, characterized by a mix of rhythmic footwork and lively partner interactions, creating an upbeat and communal atmosphere.",
    
    "about_forro.style_7_name": "Xote",
    "about_forro.style_7_desc": "A slower dance rhythm that allows for a more romantic and relaxed style. It is often danced in a close hold and typically features a gentle, flowing motion.",
    
    "about_forro.style_8_name": "Baião",
    "about_forro.style_8_desc": "A hallmark rhythm of Forró, marked by syncopation and a lively tempo. It often includes call-and-response vocals, intensifying the interaction between dancers and musicians.",
    
    "about_forro.style_9_name": "Coco",
    "about_forro.style_9_desc": "While traditionally separate from Forró, Coco is often blended into Forró music, characterized by its upbeat tempo and percussive elements, making it suitable for dance.",

    "about_forro.try_forro": "Want to Try Forró?",
    "about_forro.try_forro_desc": "Join our weekly classes and experience the joy of forró dancing!",
    "about_forro.see_schedule": "See Our Schedule"
  },
  "es": {
    "about_forro.title": "Sobre Forró",
    "about_forro.subtitle": "Descubre la rica historia y significado cultural de este hermoso baile brasileño",
    "about_forro.origins_title": "Los Orígenes del Forró",
    "about_forro.origins_p1": "El forró se originó en la región noreste de Brasil y ha evolucionado hasta convertirse en una de las formas de baile más queridas del país. Se cree que el nombre \"forró\" deriva de la frase inglesa \"for all\" (para todos), refiriéndose a la naturaleza inclusiva de los bailes públicos organizados por las compañías ferroviarias británicas para sus trabajadores a principios del siglo XX.",
    "about_forro.origins_p2": "Como género musical, el forró abarca varios ritmos, incluyendo baião, xote y arrasta-pé. El conjunto tradicional de forró, conocido como trio nordestino, consta de un acordeón (el instrumento principal), una zabumba (un tipo de tambor bajo) y un triángulo metálico.",
    "about_forro.dance_style_title": "El Estilo de Baile",
    "about_forro.dance_style_p1": "El baile forró se caracteriza por su abrazo cercano y movimientos rítmicos. Las parejas bailan con los pechos conectados mientras sus piernas se entrelazan en varios patrones de pasos. El baile va desde movimientos simples de dos pasos hasta secuencias complejas que involucran giros, caídas e improvisaciones lúdicas.",
    "about_forro.dance_style_p2": "Hay varios estilos de baile forró, incluyendo:",
    "about_forro.dance_style_list_1_name": "Forró pé-de-serra:",
    "about_forro.dance_style_list_1_desc": "El estilo tradicional, caracterizado por pasos simples y abrazo cercano",
    "about_forro.dance_style_list_2_name": "Forró universitário:",
    "about_forro.dance_style_list_2_desc": "Un estilo moderno, más elaborado, popular entre estudiantes universitários",
    "about_forro.dance_style_list_3_name": "Forró eletrônico:",
    "about_forro.dance_style_list_3_desc": "Incorpora elementos de otros estilos de baile con influencias de música electrónica",
    "about_forro.cultural_title": "Significado Cultural",
    "about_forro.cultural_p1": "El forró es más que un simple baile; es una parte vital de la identidad cultural brasileña. La música a menudo cuenta historias de la vida rural, el amor y las luchas de la gente del noreste. Durante los festivales de junio (Festas Juninas), el forró toma el centro del escenario cuando las comunidades se reúnen para celebrar con comida, baile y música.",
    "about_forro.cultural_p2": "Hoy, el forró se ha extendido internacionalmente, con comunidades y festivales dedicados en Europa, América del Norte y más allá. Su naturaleza accesible, ritmo alegre y sentido de comunidad continúan atrayendo a nuevos entusiastas en todo el mundo.",
    "about_forro.key_figures": "Figuras Clave del Forró",
    "about_forro.key_figure_1_name": "Luiz Gonzaga",
    "about_forro.key_figure_1_desc": "Conocido como el \"Rey del Baião\", popularizó la música forró en todo Brasil",
    "about_forro.key_figure_2_name": "Dominguinhos",
    "about_forro.key_figure_2_desc": "Reconocido acordeonista y compositor que modernizó el género",
    "about_forro.key_figure_3_name": "Marinês",
    "about_forro.key_figure_3_desc": "La \"Reina del Forró\", que llevó las voces femeninas al primer plano",
    "about_forro.try_forro": "¿Quieres Probar el Forró?",
    "about_forro.try_forro_desc": "¡Únete a nuestras clases semanales y experimenta la alegría del baile forró!",
    "about_forro.see_schedule": "Ver Nuestro Horario"
  },
  "pt": {
    "about_forro.title": "Sobre o Forró",
    "about_forro.subtitle": "Descubra a rica história e significado cultural desta bela dança brasileira",
    "about_forro.origins_title": "A Origem do Forró",
    "about_forro.origins_p1": "O forró originou-se na região nordeste do Brasil e evoluiu para uma das formas de dança mais amadas do país. Acredita-se que o nome \"forró\" deriva da frase inglesa \"for all\" (para todos), referindo-se à natureza inclusiva dos bailes públicos organizados pelas companhias ferroviárias britânicas para seus trabalhadores no início do século XX.",
    "about_forro.origins_p2": "Como gênero musical, o forró abrange vários ritmos, incluindo baião, xote e arrasta-pé. O conjunto tradicional de forró, conhecido como trio nordestino, consiste em um acordeão (o instrumento principal), uma zabumba (um tipo de tambor baixo) e um triângulo de metal.",
    "about_forro.dance_style_title": "O Estilo de Dança",
    "about_forro.dance_style_p1": "A dança do forró é caracterizada por seu abraço próximo e movimentos rítmicos. Os parceiros dançam com os peitos conectados enquanto suas pernas se entrelaçam em vários padrões de passos. A dança varia de movimentos simples de dois passos a sequências complexas que envolvem giros, quedas e improvisações lúdicas.",
    "about_forro.dance_style_p2": "Existem vários estilos de dança de forró, incluindo:",
    "about_forro.dance_style_list_1_name": "Forró pé-de-serra:",
    "about_forro.dance_style_list_1_desc": "O estilo tradicional, caracterizado por passos simples e abraço próximo",
    "about_forro.dance_style_list_2_name": "Forró universitário:",
    "about_forro.dance_style_list_2_desc": "Um estilo moderno, mais elaborado, popular entre estudantes universitários",
    "about_forro.dance_style_list_3_name": "Forró eletrônico:",
    "about_forro.dance_style_list_3_desc": "Incorpora elementos de outros estilos de dança com influências da música eletrônica",
    "about_forro.cultural_title": "Significado Cultural",
    "about_forro.cultural_p1": "O forró é mais do que apenas uma dança; é uma parte vital da identidade cultural brasileira. A música geralmente conta histórias da vida rural, do amor e das lutas do povo nordestino. Durante os festivais de junho (Festas Juninas), o forró assume o centro do palco quando as comunidades se reúnem para celebrar com comida, dança e música.",
    "about_forro.cultural_p2": "Hoje, o forró se espalhou internacionalmente, com comunidades e festivais dedicados na Europa, América do Norte e além. Sua natureza acessível, ritmo alegre e senso de comunidade continuam a atrair novos entusiastas em todo o mundo.",
    "about_forro.key_figures": "Figuras Chave do Forró",
    "about_forro.key_figure_1_name": "Luiz Gonzaga",
    "about_forro.key_figure_1_desc": "Conhecido como o \"Rei do Baião\", popularizou a música forró em todo o Brasil",
    "about_forro.key_figure_2_name": "Dominguinhos",
    "about_forro.key_figure_2_desc": "Renomado acordeonista e compositor que modernizou o gênero",
    "about_forro.key_figure_3_name": "Marinês",
    "about_forro.key_figure_3_desc": "A \"Rainha do Forró\", que trouxe vozes femininas para a frente",
    "about_forro.try_forro": "Quer Experimentar o Forró?",
    "about_forro.try_forro_desc": "Junte-se às nossas aulas semanais e experimente a alegria da dança do forró!",
    "about_forro.see_schedule": "Ver Nossa Programação"
  },
  "sk": {
    "about_forro.title": "O Forró",
    "about_forro.subtitle": "Objavte bohatú históriu a kultúrny význam tohto krásneho brazílskeho tanca",
    
    "about_forro.origins_title": "Čo je Forró?",
    "about_forro.origins_p1": "Forró je mnohostranný hudobný žáner a kultúrny fenomén pochádzajúci z brazílskeho severovýchodu. Zahŕňa rôzne rytmy a tance a hrá významnú úlohu v brazílskej kultúrnej identite. Termín \"Forró\" môže označovať:",
    "about_forro.origins_p2": "Hudobný žáner zložený zo súboru rytmov.\nJeden konkrétny rytmus v rámci tohto žánru.\nFormu tanca.\nTyp spoločenského stretnutia alebo večierka zameraného na túto hudbu a tanec.",
    
    "about_forro.dance_style_title": "Ako vyzerá Forró?",
    "about_forro.dance_style_p1": "Forró nie je len o hudbe; je to rovnako aj o tanci. Tanec sa vyznačuje útulnou, prívetivou atmosférou, zvyčajne zahŕňajúcou blízku prácu s partnerom. Základný krok, známy ako \"dois pra lá e dois pra cá\", spočíva v urobení dvoch krokov na jednu stranu a dvoch na druhú, čím sa vytvára rytmický vzor, ktorý umožňuje rôzne otočky, pauzy a pohyby.",
    "about_forro.dance_style_p2": "Hudba často obsahuje živý akordeón, zabumba (bubon) a triangel, s dôrazom na rytmus a skupinovú účasť, čo z nej robí komunitný zážitok na večierkoch a podujatiach.",
    "about_forro.dance_style_list_1_name": "Akordeón",
    "about_forro.dance_style_list_1_desc": "– vedúci melodický nástroj.",
    "about_forro.dance_style_list_2_name": "Zabumba",
    "about_forro.dance_style_list_2_desc": "– bubon, ktorý poskytuje hlboký, synkopovaný basový rytmus.",
    "about_forro.dance_style_list_3_name": "Triangel",
    "about_forro.dance_style_list_3_desc": "– pridáva vysoké perkusívne akcenty.",

    "about_forro.styles_title": "Štýly Forró",
    "about_forro.styles_p1": "Forró zahŕňa rôzne štýly, z ktorých každý má svoje jedinečné charakteristiky a výrazy:",

    "about_forro.style_1_name": "Pé de Serra",
    "about_forro.style_1_desc": "Tento štýl zostáva verný tradičným koreňom, charakterizovaný akustickými nástrojmi a silnými rytmami. Piesne často rozprávajú príbehy o vidieckom živote a brazílskom folklóre.",
    
    "about_forro.style_2_name": "Forró Universitário",
    "about_forro.style_2_desc": "Moderná interpretácia, ktorá sa stala populárnou v univerzitnom prostredí, spájajúca tradičné prvky so súčasnými vplyvmi a často obsahujúca rozmanitejšiu škálu nástrojov a aranžmánov.",
    
    "about_forro.style_3_name": "Forró Eletrônico",
    "about_forro.style_3_desc": "Vznikol v 90. rokoch, začleňujúc elektronické nástroje a beaty, čím sa stal prístupnejším pre mladšie publikum. Zachováva podstatu tradičného Forró a zároveň sa snaží o širší záujem v mestskom prostredí.",
    
    "about_forro.style_4_name": "Rojão",
    "about_forro.style_4_desc": "Živý a energický rytmus, ktorý zdôrazňuje silný, jasný beat, často používaný pri tancoch, ktoré zahŕňajú rýchlu prácu nôh a energické pohyby.",
    
    "about_forro.style_5_name": "Xaxado",
    "about_forro.style_5_desc": "Tento tanec zahŕňa výrazné pohyby bokov a zdôrazňuje rytmus, často spojený s cangaço (banditskou kultúrou), kde muži a ženy tancujú hrdo, predvádzajúc svoju silu a eleganciu.",
    
    "about_forro.style_6_name": "Arrasta-Pé",
    "about_forro.style_6_desc": "Sviatočný tanečný štýl oslavovaný počas forró večierkov, charakterizovaný zmesou rytmickej práce nôh a živých interakcií s partnerom, vytvárajúc pozitívnu a spoločenskú atmosféru.",
    
    "about_forro.style_7_name": "Xote",
    "about_forro.style_7_desc": "Pomalší tanečný rytmus, ktorý umožňuje romantickejší a uvoľnenejší štýl. Často sa tancuje v blízkom držaní a zvyčajne sa vyznačuje jemným, plynulým pohybom.",
    
    "about_forro.style_8_name": "Baião",
    "about_forro.style_8_desc": "Charakteristický rytmus Forró, vyznačujúci sa synkopáciou a živým tempom. Často zahŕňa spev typu \"výzva a odpoveď\", čo intenzifikuje interakciu medzi tanečníkmi a hudobníkmi.",
    
    "about_forro.style_9_name": "Coco",
    "about_forro.style_9_desc": "Aj keď je tradične oddelený od Forró, Coco je často miešaný do hudby Forró, charakterizovaný živým tempom a perkusívnymi prvkami, čo ho robí vhodným pre tanec.",

    "about_forro.try_forro": "Chcete si vyskúšať Forró?",
    "about_forro.try_forro_desc": "Pridajte sa k našim týždenným lekciám a zažite radosť z tanca forró!",
    "about_forro.see_schedule": "Pozrite si náš program"
  },
  "ua": {
    "about_forro.title": "Про Форро",
    "about_forro.subtitle": "Відкрийте для себе багату історію та культурне значення цього прекрасного бразильського танцю",
    
    "about_forro.origins_title": "Що таке Форро?",
    "about_forro.origins_p1": "Форро - це багатогранний музичний жанр і культурне явище, що походить з Північно-Східного регіону Бразилії. Воно охоплює різноманітні ритми і танці, відіграючи значну роль у бразильській культурній ідентичності. Термін \"Форро\" може означати:",
    "about_forro.origins_p2": "Музичний жанр, що складається з набору ритмів.\nОдин конкретний ритм в межах цього жанру.\nФорму танцю.\nТип соціальних зібрань або вечірок, зосереджених навколо цієї музики та танцю.",
    
    "about_forro.dance_style_title": "Як виглядає Форро?",
    "about_forro.dance_style_p1": "Форро - це не лише про музику; це в рівній мірі про танець. Танець характеризується затишною, привітною атмосферою, що зазвичай включає близьку роботу з партнером. Основний крок, відомий як \"dois pra lá e dois pra cá\", складається з двох кроків в одну сторону і двох в іншу, утворюючи ритмічний візерунок, що дозволяє різноманітні повороти, паузи та рухи.",
    "about_forro.dance_style_p2": "Музика часто містить жвавий акордеон, забумба (барабан) і трикутник, з акцентом на ритм і групову участь, роблячи це спільним досвідом на вечірках і заходах.",
    "about_forro.dance_style_list_1_name": "Акордеон",
    "about_forro.dance_style_list_1_desc": "– головний мелодійний інструмент.",
    "about_forro.dance_style_list_2_name": "Забумба",
    "about_forro.dance_style_list_2_desc": "– барабан, що забезпечує глибокий, синкопований басовий ритм.",
    "about_forro.dance_style_list_3_name": "Трикутник",
    "about_forro.dance_style_list_3_desc": "– додає високочастотні перкусійні акценти.",

    "about_forro.styles_title": "Стилі Форро",
    "about_forro.styles_p1": "Форро охоплює різні стилі, кожен з яких має свої унікальні характеристики та вираження:",

    "about_forro.style_1_name": "Pé de Serra",
    "about_forro.style_1_desc": "Цей стиль зберігає вірність традиційним кореням, характеризується акустичною інструментацією та сильними ритмами. Пісні часто розповідають історії сільського життя та бразильського фольклору.",
    
    "about_forro.style_2_name": "Forró Universitário",
    "about_forro.style_2_desc": "Сучасна інтерпретація, що стала популярною в університетському середовищі, поєднуючи традиційні елементи з сучасними впливами, часто з більш різноманітним набором інструментів та аранжувань.",
    
    "about_forro.style_3_name": "Forró Eletrônico",
    "about_forro.style_3_desc": "З'явився в 1990-х роках, включаючи електронні інструменти та біти, роблячи його більш доступним для молодої аудиторії. Він зберігає сутність традиційного Форро, прагнучи до ширшого визнання в міському середовищі.",
    
    "about_forro.style_4_name": "Rojão",
    "about_forro.style_4_desc": "Жвавий і бадьорий ритм, що підкреслює сильний, чіткий біт, часто використовується в танцях, які включають швидку роботу ніг та енергійні рухи.",
    
    "about_forro.style_5_name": "Xaxado",
    "about_forro.style_5_desc": "Цей танець включає виразні рухи стегон і підкреслює ритм, часто асоціюється з cangaço (культурою бандитів), де чоловіки і жінки танцюють гордо, демонструючи свою силу та елегантність.",
    
    "about_forro.style_6_name": "Arrasta-Pé",
    "about_forro.style_6_desc": "Святковий танцювальний стиль, що святкується під час вечірок форро, характеризується сумішшю ритмічної роботи ніг та жвавих партнерських взаємодій, створюючи піднесену та комунальну атмосферу.",
    
    "about_forro.style_7_name": "Xote",
    "about_forro.style_7_desc": "Повільніший танцювальний ритм, що дозволяє більш романтичний і розслаблений стиль. Часто танцюється в тісному об'єднанні і зазвичай характеризується м'яким, плинним рухом.",
    
    "about_forro.style_8_name": "Baião",
    "about_forro.style_8_desc": "Характерний ритм Форро, виділяється синкопуванням та жвавим темпом. Часто включає вокал типу \"поклик-відповідь\", посилюючи взаємодію між танцюристами і музикантами.",
    
    "about_forro.style_9_name": "Coco",
    "about_forro.style_9_desc": "Хоча традиційно відокремлений від Форро, Коко часто змішується в музику Форро, характеризується жвавим темпом і перкусійними елементами, роблячи його придатним для танцю.",

    "about_forro.try_forro": "Хочете спробувати Форро?",
    "about_forro.try_forro_desc": "Приєднуйтесь до наших щотижневих занять і відчуйте радість танцю форро!",
    "about_forro.see_schedule": "Переглянути наш розклад"
  }
}
