
{
  "en": {
    "about_forro.title": "About Forró",
    "about_forro.subtitle": "Discover the rich history and cultural significance of this beautiful Brazilian dance",
    
    "about_forro.origins_title": "What is Forró?",
    "about_forro.origins_p1": "Forró is a multifaceted musical genre and cultural phenomenon that emerges from Brazil's Northeast region. It encompasses a variety of rhythms and dances, playing a significant role in Brazilian cultural identity. The term \"Forró\" can refer to:",
    "about_forro.origins_p2": "A musical genre composed of a set of rhythms.\nOne specific rhythm within that genre.\nA form of dance.\nA type of social gathering or party centered around this music and dance.",
    
    "about_forro.dance_style_title": "How Does Forró Look?",
    "about_forro.dance_style_p1": "Forró is not just about the music; it is equally about the dance. The dance is characterized by its cozy, inviting atmosphere, typically involving close partner work. The basic step, known as \"dois pra lá e dois pra cá,\" consists of taking two steps to one side and two to the other, forming a rhythmic pattern that allows for various turns, pauses, and movements.",
    "about_forro.dance_style_p2": "The music often features lively accordion, zabumba (a drum), and triangle, with a focus on rhythm and group participation, making it a communal experience at parties and events.",
    "about_forro.dance_style_list_1_name": "Accordion",
    "about_forro.dance_style_list_1_desc": "– the lead melodic instrument.",
    "about_forro.dance_style_list_2_name": "Zabumba",
    "about_forro.dance_style_list_2_desc": "– a drum that provides a deep, syncopated bass rhythm.",
    "about_forro.dance_style_list_3_name": "Triangle",
    "about_forro.dance_style_list_3_desc": "– adds high-pitched percussive accents.",

    "about_forro.styles_title": "Styles of Forró",
    "about_forro.styles_p1": "Forró encompasses various styles, each with its own unique characteristics and expressions:",

    "about_forro.style_1_name": "Pé de Serra",
    "about_forro.style_1_desc": "This style stays true to traditional roots, characterized by its acoustic instrumentation and strong rhythms. Songs often tell stories of rural life and Brazilian folklore.",
    
    "about_forro.style_2_name": "Forró Universitário",
    "about_forro.style_2_desc": "A modern interpretation that became popular in university settings, blending traditional elements with contemporary influences, and often featuring a more diverse range of instruments and arrangements.",
    
    "about_forro.style_3_name": "Forró Eletrônico",
    "about_forro.style_3_desc": "Emerged in the 1990s, incorporating electronic instruments and beats, making it more accessible to younger audiences. It retains the essence of traditional Forró while aiming for broader appeal in urban settings.",
    
    "about_forro.style_4_name": "Rojão",
    "about_forro.style_4_desc": "A lively and upbeat rhythm that emphasizes a strong, clear beat, often used in dances that involve quick footwork and energetic movements.",
    
    "about_forro.style_5_name": "Xaxado",
    "about_forro.style_5_desc": "This dance includes distinct hip movements and emphasizes rhythm, often associated with the cangaço (bandit culture) where men and women dance proudly, showcasing their strength and elegance.",
    
    "about_forro.style_6_name": "Arrasta-Pé",
    "about_forro.style_6_desc": "A festive dance style celebrated during forró parties, characterized by a mix of rhythmic footwork and lively partner interactions, creating an upbeat and communal atmosphere.",
    
    "about_forro.style_7_name": "Xote",
    "about_forro.style_7_desc": "A slower dance rhythm that allows for a more romantic and relaxed style. It is often danced in a close hold and typically features a gentle, flowing motion.",
    
    "about_forro.style_8_name": "Baião",
    "about_forro.style_8_desc": "A hallmark rhythm of Forró, marked by syncopation and a lively tempo. It often includes call-and-response vocals, intensifying the interaction between dancers and musicians.",
    
    "about_forro.style_9_name": "Coco",
    "about_forro.style_9_desc": "While traditionally separate from Forró, Coco is often blended into Forró music, characterized by its upbeat tempo and percussive elements, making it suitable for dance.",

    "about_forro.try_forro": "Want to Try Forró?",
    "about_forro.try_forro_desc": "Join our weekly classes and experience the joy of forró dancing!",
    "about_forro.see_schedule": "See Our Schedule"
  },
    "es": {
    "about_forro.title": "Sobre el Forró",
    "about_forro.subtitle": "Descubre la rica historia y el significado cultural de esta hermosa danza brasileña",
    
    "about_forro.origins_title": "¿Qué es el Forró?",
    "about_forro.origins_p1": "El forró es un género musical multifacético y un fenómeno cultural que surge en la región noreste de Brasil. Abarca una variedad de ritmos y danzas, desempeñando un papel importante en la identidad cultural brasileña. El término \"Forró\" puede referirse a:",
    "about_forro.origins_p2": "Un género musical compuesto por varios ritmos.\nUn ritmo específico dentro de ese género.\nUna forma de baile.\nUn tipo de fiesta o reunión social centrada en esta música y danza.",

    "about_forro.dance_style_title": "¿Cómo se ve el Forró?",
    "about_forro.dance_style_p1": "El forró no es solo música; también es danza. Se caracteriza por un ambiente acogedor e íntimo, generalmente con trabajo en pareja. El paso básico, conocido como \"dos para allá y dos para acá\", consiste en dar dos pasos hacia un lado y dos hacia el otro, formando un patrón rítmico que permite giros, pausas y movimientos.",
    "about_forro.dance_style_p2": "La música suele presentar acordeón animado, zabumba (un tambor) y triángulo, con énfasis en el ritmo y la participación del grupo, lo que lo convierte en una experiencia comunitaria en fiestas y eventos.",
    "about_forro.dance_style_list_1_name": "Acordeón",
    "about_forro.dance_style_list_1_desc": "– el instrumento melódico principal.",
    "about_forro.dance_style_list_2_name": "Zabumba",
    "about_forro.dance_style_list_2_desc": "– un tambor que proporciona un ritmo grave y sincopado.",
    "about_forro.dance_style_list_3_name": "Triángulo",
    "about_forro.dance_style_list_3_desc": "– añade acentos percutivos agudos.",

    "about_forro.styles_title": "Estilos de Forró",
    "about_forro.styles_p1": "El forró abarca varios estilos, cada uno con sus características y expresiones únicas:",

    "about_forro.style_1_name": "Pé de Serra",
    "about_forro.style_1_desc": "Este estilo permanece fiel a las raíces tradicionales, caracterizado por su instrumentación acústica y ritmos fuertes. Las canciones suelen contar historias de la vida rural y del folclore brasileño.",
    
    "about_forro.style_2_name": "Forró Universitário",
    "about_forro.style_2_desc": "Una interpretación moderna que se popularizó en entornos universitarios, combinando elementos tradicionales con influencias contemporáneas y una gama más diversa de instrumentos y arreglos.",
    
    "about_forro.style_3_name": "Forró Eletrônico",
    "about_forro.style_3_desc": "Surgido en los años 90, incorpora instrumentos electrónicos y ritmos modernos, haciéndolo más accesible a un público joven. Conserva la esencia del forró tradicional con un atractivo más urbano.",
    
    "about_forro.style_4_name": "Rojão",
    "about_forro.style_4_desc": "Un ritmo animado y acelerado que enfatiza una base fuerte y clara, ideal para bailes con pasos rápidos y movimientos enérgicos.",
    
    "about_forro.style_5_name": "Xaxado",
    "about_forro.style_5_desc": "Este baile incluye movimientos distintivos de cadera y énfasis en el ritmo, a menudo asociado al cangaço, donde hombres y mujeres bailan con orgullo, mostrando fuerza y elegancia.",
    
    "about_forro.style_6_name": "Arrasta-Pé",
    "about_forro.style_6_desc": "Un estilo festivo celebrado en fiestas de forró, caracterizado por pasos rítmicos y animadas interacciones entre parejas, creando una atmósfera alegre y comunitaria.",
    
    "about_forro.style_7_name": "Xote",
    "about_forro.style_7_desc": "Un ritmo de baile más lento que permite un estilo más romántico y relajado. A menudo se baila en un abrazo cerrado y presenta movimientos suaves y fluidos.",
    
    "about_forro.style_8_name": "Baião",
    "about_forro.style_8_desc": "Un ritmo emblemático del forró, con sincopación y tempo animado. Frecuentemente incluye voces de llamada y respuesta, intensificando la interacción entre bailarines y músicos.",
    
    "about_forro.style_9_name": "Coco",
    "about_forro.style_9_desc": "Aunque tradicionalmente separado del forró, el coco se mezcla a menudo en la música del forró. Se caracteriza por su ritmo animado y elementos percusivos, perfecto para bailar.",
    
    "about_forro.try_forro": "¿Quieres probar el Forró?",
    "about_forro.try_forro_desc": "¡Únete a nuestras clases semanales y experimenta la alegría de bailar forró!",
    "about_forro.see_schedule": "Ver nuestro horario"
  },
    "pt": {
    "about_forro.title": "Sobre o Forró",
    "about_forro.subtitle": "Descubra a rica história e a importância cultural dessa bela dança brasileira",
    
    "about_forro.origins_title": "O que é Forró?",
    "about_forro.origins_p1": "O forró é um gênero musical multifacetado e um fenômeno cultural originário da região Nordeste do Brasil. Ele engloba uma variedade de ritmos e danças, desempenhando um papel importante na identidade cultural brasileira. O termo \"Forró\" pode se referir a:",
    "about_forro.origins_p2": "Um gênero musical composto por um conjunto de ritmos.\nUm ritmo específico dentro desse gênero.\nUma forma de dança.\nUm tipo de festa ou encontro social centrado nessa música e dança.",

    "about_forro.dance_style_title": "Como é o Forró?",
    "about_forro.dance_style_p1": "O Forró não é apenas música; é também dança. A dança é caracterizada por um ambiente acolhedor e convidativo, geralmente envolvendo trabalho em dupla. O passo básico, conhecido como \"dois pra lá e dois pra cá\", consiste em dois passos para um lado e dois para o outro, formando um padrão rítmico que permite diversos giros, pausas e movimentos.",
    "about_forro.dance_style_p2": "A música frequentemente apresenta sanfona animada, zabumba e triângulo, com foco no ritmo e na participação do grupo, tornando-se uma experiência comunitária em festas e eventos.",
    "about_forro.dance_style_list_1_name": "Sanfona",
    "about_forro.dance_style_list_1_desc": "– o instrumento melódico principal.",
    "about_forro.dance_style_list_2_name": "Zabumba",
    "about_forro.dance_style_list_2_desc": "– um tambor que fornece um ritmo grave e sincopado.",
    "about_forro.dance_style_list_3_name": "Triângulo",
    "about_forro.dance_style_list_3_desc": "– adiciona acentos percussivos agudos.",

    "about_forro.styles_title": "Estilos de Forró",
    "about_forro.styles_p1": "O Forró abrange vários estilos, cada um com suas características e expressões únicas:",

    "about_forro.style_1_name": "Pé de Serra",
    "about_forro.style_1_desc": "Este estilo permanece fiel às raízes tradicionais, caracterizado por sua instrumentação acústica e ritmos marcantes. As canções costumam contar histórias da vida rural e do folclore brasileiro.",
    
    "about_forro.style_2_name": "Forró Universitário",
    "about_forro.style_2_desc": "Uma interpretação moderna que se popularizou em ambientes universitários, misturando elementos tradicionais com influências contemporâneas e uma gama mais diversa de instrumentos e arranjos.",
    
    "about_forro.style_3_name": "Forró Eletrônico",
    "about_forro.style_3_desc": "Surgido nos anos 90, incorpora instrumentos e batidas eletrônicas, tornando-o mais acessível ao público jovem. Mantém a essência do Forró tradicional com um apelo mais urbano.",
    
    "about_forro.style_4_name": "Rojão",
    "about_forro.style_4_desc": "Um ritmo animado e acelerado que enfatiza uma batida forte e clara, frequentemente usado em danças com passos rápidos e movimentos enérgicos.",
    
    "about_forro.style_5_name": "Xaxado",
    "about_forro.style_5_desc": "Esta dança inclui movimentos de quadril distintos e ênfase no ritmo, muitas vezes associada ao cangaço, onde homens e mulheres dançam com orgulho, demonstrando força e elegância.",
    
    "about_forro.style_6_name": "Arrasta-Pé",
    "about_forro.style_6_desc": "Um estilo festivo celebrado nas festas de forró, caracterizado por passos rítmicos e interações animadas entre os pares, criando uma atmosfera alegre e comunitária.",
    
    "about_forro.style_7_name": "Xote",
    "about_forro.style_7_desc": "Um ritmo de dança mais lento que permite um estilo mais romântico e relaxado. É frequentemente dançado em posição fechada e apresenta movimentos suaves e fluentes.",
    
    "about_forro.style_8_name": "Baião",
    "about_forro.style_8_desc": "Um ritmo marcante do Forró, com sincopação e tempo animado. Frequentemente inclui vocais em estilo de pergunta e resposta, intensificando a interação entre dançarinos e músicos.",
    
    "about_forro.style_9_name": "Coco",
    "about_forro.style_9_desc": "Embora tradicionalmente separado do Forró, o Coco é frequentemente incorporado à música do Forró. É caracterizado por seu ritmo animado e elementos percussivos, ideal para dançar.",
    
    "about_forro.try_forro": "Quer experimentar o Forró?",
    "about_forro.try_forro_desc": "Participe de nossas aulas semanais e sinta a alegria de dançar forró!",
    "about_forro.see_schedule": "Veja nossa programação"
  },
  "ru": {
  "about_forro.title": "О Форро",
  "about_forro.subtitle": "Откройте для себя богатую историю и культурную значимость этого красивого бразильского танца",

  "about_forro.origins_title": "Что такое Форро?",
  "about_forro.origins_p1": "Форро — это многогранный музыкальный жанр и культурное явление, происходящее с северо-востока Бразилии. Он включает в себя различные ритмы и танцы и играет важную роль в бразильской культурной идентичности. Термин \"форро\" может означать:",
  "about_forro.origins_p2": "Музыкальный жанр, включающий ряд ритмов.\nКонкретный ритм внутри этого жанра.\nФорма танца.\nТип вечеринки или социального собрания, посвящённого этой музыке и танцу.",

  "about_forro.dance_style_title": "Как выглядит Форро?",
  "about_forro.dance_style_p1": "Форро — это не только музыка, но и танец. Танец характеризуется уютной, доверительной атмосферой и обычно исполняется в паре. Основной шаг — «два туда и два обратно» — формирует ритмический узор, который позволяет выполнять вращения, остановки и другие движения.",
  "about_forro.dance_style_p2": "В музыке часто звучат аккордеон, забумба (барабан) и треугольник, акцент делается на ритме и совместном участии, что делает форро коллективным праздником.",
  "about_forro.dance_style_list_1_name": "Аккордеон",
  "about_forro.dance_style_list_1_desc": "– основной мелодический инструмент.",
  "about_forro.dance_style_list_2_name": "Забумба",
  "about_forro.dance_style_list_2_desc": "– барабан, обеспечивающий глубокий, синкопированный ритм.",
  "about_forro.dance_style_list_3_name": "Треугольник",
  "about_forro.dance_style_list_3_desc": "– добавляет высокочастотные ударные акценты.",

  "about_forro.styles_title": "Стили Форро",
  "about_forro.styles_p1": "Форро включает в себя различные стили, каждый со своими уникальными чертами и выражениями:",

  "about_forro.style_1_name": "Pé de Serra",
  "about_forro.style_1_desc": "Традиционный стиль с акцентом на акустические инструменты и сильный ритм. Песни часто рассказывают о сельской жизни и фольклоре.",
  "about_forro.style_2_name": "Forró Universitário",
  "about_forro.style_2_desc": "Современная версия, популярная среди студентов, смешивает традиционные и современные элементы.",
  "about_forro.style_3_name": "Forró Eletrônico",
  "about_forro.style_3_desc": "Появился в 1990-х годах, включает электронные инструменты и ритмы, ориентирован на молодую городскую аудиторию.",
  "about_forro.style_4_name": "Rojão",
  "about_forro.style_4_desc": "Энергичный ритм с чётким ударом, используется в танцах с быстрыми движениями.",
  "about_forro.style_5_name": "Xaxado",
  "about_forro.style_5_desc": "Танец с выразительными движениями бёдер, связан с культурой кангасу.",
  "about_forro.style_6_name": "Arrasta-Pé",
  "about_forro.style_6_desc": "Праздничный стиль с живыми парными взаимодействиями и ритмичной работой ног.",
  "about_forro.style_7_name": "Xote",
  "about_forro.style_7_desc": "Более медленный и романтичный ритм, часто танцуется в тесной паре.",
  "about_forro.style_8_name": "Baião",
  "about_forro.style_8_desc": "Ключевой ритм форро с синкопами и энергичным темпом. Часто включает вокальные переклички.",
  "about_forro.style_9_name": "Coco",
  "about_forro.style_9_desc": "Хотя и отдельный стиль, Коко часто сочетается с форро и отличается перкуссионными элементами и быстрым темпом.",

  "about_forro.try_forro": "Хотите попробовать форро?",
  "about_forro.try_forro_desc": "Присоединяйтесь к нашим еженедельным занятиям и почувствуйте радость танца!",
  "about_forro.see_schedule": "Посмотреть расписание"
},
"ua": {
  "about_forro.title": "Про Форро",
  "about_forro.subtitle": "Дізнайтеся про багату історію та культурну значущість цього прекрасного бразильського танцю",

  "about_forro.origins_title": "Що таке Форро?",
  "about_forro.origins_p1": "Форро — це багатогранний музичний жанр і культурне явище, яке походить з північно-східного регіону Бразилії. Він охоплює різні ритми та танці, відіграючи важливу роль у культурній ідентичності бразильців. Термін «форро» може означати:",
  "about_forro.origins_p2": "Музичний жанр із сукупністю ритмів.\nОкремий ритм у межах жанру.\nФорма танцю.\nТип вечірки або зустрічі, присвяченої цій музиці та танцю.",

  "about_forro.dance_style_title": "Як виглядає Форро?",
  "about_forro.dance_style_p1": "Форро — це не лише музика, але й танець. Танцювальний стиль вирізняється затишною атмосферою і танцями в парі. Основний крок — «два вліво і два вправо» — створює ритмічний малюнок для обертань, пауз і рухів.",
  "about_forro.dance_style_p2": "У музиці часто використовуються акордеон, забумба (барабан) і трикутник. Усе це створює ритмічну основу та заохочує спільну участь у святі.",
  "about_forro.dance_style_list_1_name": "Акордеон",
  "about_forro.dance_style_list_1_desc": "– провідний мелодійний інструмент.",
  "about_forro.dance_style_list_2_name": "Забумба",
  "about_forro.dance_style_list_2_desc": "– барабан із глибоким синкопованим ритмом.",
  "about_forro.dance_style_list_3_name": "Трикутник",
  "about_forro.dance_style_list_3_desc": "– додає високочастотні перкусійні акценти.",

  "about_forro.styles_title": "Стилі Форро",
  "about_forro.styles_p1": "Форро має кілька стилів, кожен із яких має свої особливості:",

  "about_forro.style_1_name": "Pé de Serra",
  "about_forro.style_1_desc": "Традиційний стиль із акцентом на акустичні інструменти та ритм. У піснях часто описують сільське життя та фольклор.",
  "about_forro.style_2_name": "Forró Universitário",
  "about_forro.style_2_desc": "Сучасна версія, популярна серед студентів, змішує традиційне й нове.",
  "about_forro.style_3_name": "Forró Eletrônico",
  "about_forro.style_3_desc": "З’явився в 1990-х роках. Включає електронні інструменти, орієнтований на молодь.",
  "about_forro.style_4_name": "Rojão",
  "about_forro.style_4_desc": "Енергійний ритм із чітким темпом і швидкими рухами.",
  "about_forro.style_5_name": "Xaxado",
  "about_forro.style_5_desc": "Танець із виразними рухами стегон, асоційований із культурою кангасу.",
  "about_forro.style_6_name": "Arrasta-Pé",
  "about_forro.style_6_desc": "Святковий стиль із веселими рухами пари й ритмічними кроками.",
  "about_forro.style_7_name": "Xote",
  "about_forro.style_7_desc": "Повільніший романтичний ритм із плавними рухами.",
  "about_forro.style_8_name": "Baião",
  "about_forro.style_8_desc": "Класичний ритм із синкопами та вокальними перекличками.",
  "about_forro.style_9_name": "Coco",
  "about_forro.style_9_desc": "Окремий, але часто поєднуваний із форро стиль із перкусією та темпом для танцю.",

  "about_forro.try_forro": "Хочете спробувати форро?",
  "about_forro.try_forro_desc": "Приєднуйтесь до наших щотижневих занять і відчуйте радість танцю!",
  "about_forro.see_schedule": "Переглянути розклад"
},
"cz": {
  "about_forro.title": "O Forró",
  "about_forro.subtitle": "Objevte bohatou historii a kulturní význam tohoto krásného brazilského tance",

  "about_forro.origins_title": "Co je Forró?",
  "about_forro.origins_p1": "Forró je mnohostranný hudební žánr a kulturní fenomén pocházející ze severovýchodní Brazílie. Zahrnuje různé rytmy a tance a hraje důležitou roli v brazilské kulturní identitě. Termín „Forró“ může znamenat:",
  "about_forro.origins_p2": "Hudební žánr tvořený různými rytmy.\nJeden specifický rytmus v rámci tohoto žánru.\nFormu tance.\nTyp společenské události nebo večírku souvisejícího s touto hudbou a tancem.",

  "about_forro.dance_style_title": "Jak vypadá Forró?",
  "about_forro.dance_style_p1": "Forró není jen o hudbě, ale také o tanci. Tanec se vyznačuje intimní a přívětivou atmosférou, obvykle v páru. Základní krok, známý jako „dva tam a dva zpět“, sestává ze dvou kroků na jednu stranu a dvou na druhou, což tvoří rytmický vzorec pro různé otočky a pauzy.",
  "about_forro.dance_style_p2": "Hudba často obsahuje akordeon, zabumbu (buben) a triangl, s důrazem na rytmus a společnou účast – což z něj činí komunitní zážitek.",
  "about_forro.dance_style_list_1_name": "Akordeon",
  "about_forro.dance_style_list_1_desc": "– hlavní melodický nástroj.",
  "about_forro.dance_style_list_2_name": "Zabumba",
  "about_forro.dance_style_list_2_desc": "– buben s hlubokým, synkopovaným rytmem.",
  "about_forro.dance_style_list_3_name": "Triangl",
  "about_forro.dance_style_list_3_desc": "– přidává vysoké perkusní akcenty.",

  "about_forro.styles_title": "Styly Forró",
  "about_forro.styles_p1": "Forró zahrnuje různé styly, z nichž každý má své jedinečné rysy a výrazy:",

  "about_forro.style_1_name": "Pé de Serra",
  "about_forro.style_1_desc": "Tradiční styl s akustickými nástroji a silným rytmem. Texty často vyprávějí o venkovském životě a folklóru.",
  "about_forro.style_2_name": "Forró Universitário",
  "about_forro.style_2_desc": "Moderní varianta populární mezi studenty, spojuje tradiční prvky se současnými vlivy.",
  "about_forro.style_3_name": "Forró Eletrônico",
  "about_forro.style_3_desc": "Vznikl v 90. letech, obsahuje elektronické nástroje a beaty, cílený na mladší publikum.",
  "about_forro.style_4_name": "Rojão",
  "about_forro.style_4_desc": "Živý rytmus s důrazným taktem, vhodný pro rychlé a energické pohyby.",
  "about_forro.style_5_name": "Xaxado",
  "about_forro.style_5_desc": "Tanec s výraznými pohyby boků, spojený s kulturou cangaço.",
  "about_forro.style_6_name": "Arrasta-Pé",
  "about_forro.style_6_desc": "Veselý styl se živým pohybem nohou a partnerskými interakcemi.",
  "about_forro.style_7_name": "Xote",
  "about_forro.style_7_desc": "Pomalejší romantický rytmus s jemným a plynulým pohybem.",
  "about_forro.style_8_name": "Baião",
  "about_forro.style_8_desc": "Základní rytmus forró se synkopami a živým tempem, často obsahuje vokální odpovědi.",
  "about_forro.style_9_name": "Coco",
  "about_forro.style_9_desc": "Původně samostatný styl, který se často kombinuje s forró. Má rychlé tempo a výraznou rytmiku.",

  "about_forro.try_forro": "Chcete si zkusit Forró?",
  "about_forro.try_forro_desc": "Přidejte se na naše týdenní kurzy a zažijte radost z tance forró!",
  "about_forro.see_schedule": "Zobrazit rozvrh"
},
"sk": {
  "about_forro.title": "O Forró",
  "about_forro.subtitle": "Objavte bohatú históriu a kultúrny význam tohto krásneho brazílskeho tanca",

  "about_forro.origins_title": "Čo je Forró?",
  "about_forro.origins_p1": "Forró je mnohostranný hudobný žáner a kultúrny fenomén pochádzajúci zo severovýchodnej Brazílie. Zastrešuje rôzne rytmy a tance a zohráva významnú úlohu v brazílskej kultúrnej identite. Pojem „Forró“ môže znamenať:",
  "about_forro.origins_p2": "Hudobný žáner zložený z rôznych rytmov.\nJeden konkrétny rytmus v rámci žánru.\nFormu tanca.\nSpoločenskú udalosť alebo večierok založený na tejto hudbe a tanci.",

  "about_forro.dance_style_title": "Ako vyzerá Forró?",
  "about_forro.dance_style_p1": "Forró nie je len o hudbe – je to aj o tanci. Tanec je známy svojou prívetivou a blízkou atmosférou, zvyčajne tancovaný v páre. Základný krok – „dva tam a dva späť“ – vytvára rytmický vzor, ktorý umožňuje otáčky, prestávky a rôzne pohyby.",
  "about_forro.dance_style_p2": "Hudba často obsahuje akordeón, zabumbu (bubón) a triangl, so zameraním na rytmus a komunitné zapojenie, čo robí forró spoločenským zážitkom.",
  "about_forro.dance_style_list_1_name": "Akordeón",
  "about_forro.dance_style_list_1_desc": "– hlavný melodický nástroj.",
  "about_forro.dance_style_list_2_name": "Zabumba",
  "about_forro.dance_style_list_2_desc": "– bubon s hlbokým, synkopovaným rytmom.",
  "about_forro.dance_style_list_3_name": "Triangel",
  "about_forro.dance_style_list_3_desc": "– pridáva vysokofrekvenčné perkusívne akcenty.",

  "about_forro.styles_title": "Štýly Forró",
  "about_forro.styles_p1": "Forró zahŕňa rôzne štýly, každý s vlastnými jedinečnými črtami a prejavmi:",

  "about_forro.style_1_name": "Pé de Serra",
  "about_forro.style_1_desc": "Tradičný štýl s akustickými nástrojmi a silným rytmom. Texty často hovoria o vidieckom živote a folklóre.",
  "about_forro.style_2_name": "Forró Universitário",
  "about_forro.style_2_desc": "Moderná interpretácia populárna medzi študentmi, ktorá kombinuje tradičné a súčasné prvky.",
  "about_forro.style_3_name": "Forró Eletrônico",
  "about_forro.style_3_desc": "Vznikol v 90. rokoch s využitím elektronických nástrojov a beatov. Zameraný na mladé publikum.",
  "about_forro.style_4_name": "Rojão",
  "about_forro.style_4_desc": "Rýchly rytmus s dôrazným tempom, používaný pri energických tancoch.",
  "about_forro.style_5_name": "Xaxado",
  "about_forro.style_5_desc": "Tanec s výrazným pohybom bokov, spojený s kultúrou cangaço.",
  "about_forro.style_6_name": "Arrasta-Pé",
  "about_forro.style_6_desc": "Slávnostný štýl s rytmickým pohybom nôh a interakciou medzi partnermi.",
  "about_forro.style_7_name": "Xote",
  "about_forro.style_7_desc": "Pomalší, romantický rytmus s jemnými, plynulými pohybmi.",
  "about_forro.style_8_name": "Baião",
  "about_forro.style_8_desc": "Typický rytmus forró so synkopou a živým tempom. Často zahŕňa vokálnu interakciu.",
  "about_forro.style_9_name": "Coco",
  "about_forro.style_9_desc": "Aj keď ide o samostatný štýl, často sa spája s forró. Vyznačuje sa perkusívnymi prvkami a rýchlym tempom.",

  "about_forro.try_forro": "Chcete si vyskúšať Forró?",
  "about_forro.try_forro_desc": "Pridajte sa k našim týždenným kurzom a zažite radosť z tanca!",
  "about_forro.see_schedule": "Zobraziť rozvrh"
}
}
