
{
  "en": {
    "about_forro.title": "About Forró",
    "about_forro.subtitle": "Discover the rich history and cultural significance of this beautiful Brazilian dance",
    
    "about_forro.origins_title": "What is Forró?",
    "about_forro.origins_p1": "Forró is a multifaceted musical genre and cultural phenomenon that emerges from Brazil's Northeast region. It encompasses a variety of rhythms and dances, playing a significant role in Brazilian cultural identity. The term \"Forró\" can refer to:",
    "about_forro.origins_p2": "A musical genre composed of a set of rhythms.\nOne specific rhythm within that genre.\nA form of dance.\nA type of social gathering or party centered around this music and dance.",
    
    "about_forro.dance_style_title": "How Does Forró Look?",
    "about_forro.dance_style_p1": "Forró is not just about the music; it is equally about the dance. The dance is characterized by its cozy, inviting atmosphere, typically involving close partner work. The basic step, known as \"dois pra lá e dois pra cá,\" consists of taking two steps to one side and two to the other, forming a rhythmic pattern that allows for various turns, pauses, and movements.",
    "about_forro.dance_style_p2": "The music often features lively accordion, zabumba (a drum), and triangle, with a focus on rhythm and group participation, making it a communal experience at parties and events.",
    "about_forro.dance_style_list_1_name": "Accordion",
    "about_forro.dance_style_list_1_desc": "– the lead melodic instrument.",
    "about_forro.dance_style_list_2_name": "Zabumba",
    "about_forro.dance_style_list_2_desc": "– a drum that provides a deep, syncopated bass rhythm.",
    "about_forro.dance_style_list_3_name": "Triangle",
    "about_forro.dance_style_list_3_desc": "– adds high-pitched percussive accents.",

    "about_forro.cultural_title": "Main Styles of Forró",
    "about_forro.cultural_p1": "Musical Styles of Forró\n\nPé de Serra: This style stays true to traditional roots, characterized by its acoustic instrumentation and strong rhythms. Songs often tell stories of rural life and Brazilian folklore.\n\nForró Universitário: A modern interpretation that became popular in university settings, blending traditional elements with contemporary influences, and often featuring a more diverse range of instruments and arrangements.\n\nForró Eletrônico: Emerged in the 1990s, incorporating electronic instruments and beats, making it more accessible to younger audiences. It retains the essence of traditional Forró while aiming for broader appeal in urban settings.\n\nRojão: A lively and upbeat rhythm that emphasizes a strong, clear beat, often used in dances that involve quick footwork and energetic movements.",
    "about_forro.cultural_p2": "Dance Styles of Forró\n\nXaxado: This dance includes distinct hip movements and emphasizes rhythm, often associated with the cangaço (bandit culture) where men and women dance proudly, showcasing their strength and elegance.\n\nArrasta-Pé: A festive dance style celebrated during forró parties, characterized by a mix of rhythmic footwork and lively partner interactions, creating an upbeat and communal atmosphere.\n\nXote: A slower dance rhythm that allows for a more romantic and relaxed style. It is often danced in a close hold and typically features a gentle, flowing motion.\n\nBaião: A hallmark rhythm of Forró, marked by syncopation and a lively tempo. It often includes call-and-response vocals, intensifying the interaction between dancers and musicians.\n\nCoco: While traditionally separate from Forró, Coco is often blended into Forró music, characterized by its upbeat tempo and percussive elements, making it suitable for dance.",

    "about_forro.try_forro": "Want to Try Forró?",
    "about_forro.try_forro_desc": "Join our weekly classes and experience the joy of forró dancing!",
    "about_forro.see_schedule": "See Our Schedule"
  },
  "es": {
    "about_forro.title": "Sobre Forró",
    "about_forro.subtitle": "Descubre la rica historia y significado cultural de este hermoso baile brasileño",
    "about_forro.origins_title": "Los Orígenes del Forró",
    "about_forro.origins_p1": "El forró se originó en la región noreste de Brasil y ha evolucionado hasta convertirse en una de las formas de baile más queridas del país. Se cree que el nombre \"forró\" deriva de la frase inglesa \"for all\" (para todos), refiriéndose a la naturaleza inclusiva de los bailes públicos organizados por las compañías ferroviarias británicas para sus trabajadores a principios del siglo XX.",
    "about_forro.origins_p2": "Como género musical, el forró abarca varios ritmos, incluyendo baião, xote y arrasta-pé. El conjunto tradicional de forró, conocido como trio nordestino, consta de un acordeón (el instrumento principal), una zabumba (un tipo de tambor bajo) y un triángulo metálico.",
    "about_forro.dance_style_title": "El Estilo de Baile",
    "about_forro.dance_style_p1": "El baile forró se caracteriza por su abrazo cercano y movimientos rítmicos. Las parejas bailan con los pechos conectados mientras sus piernas se entrelazan en varios patrones de pasos. El baile va desde movimientos simples de dos pasos hasta secuencias complejas que involucran giros, caídas e improvisaciones lúdicas.",
    "about_forro.dance_style_p2": "Hay varios estilos de baile forró, incluyendo:",
    "about_forro.dance_style_list_1_name": "Forró pé-de-serra:",
    "about_forro.dance_style_list_1_desc": "El estilo tradicional, caracterizado por pasos simples y abrazo cercano",
    "about_forro.dance_style_list_2_name": "Forró universitário:",
    "about_forro.dance_style_list_2_desc": "Un estilo moderno, más elaborado, popular entre estudiantes universitarios",
    "about_forro.dance_style_list_3_name": "Forró eletrônico:",
    "about_forro.dance_style_list_3_desc": "Incorpora elementos de otros estilos de baile con influencias de música electrónica",
    "about_forro.cultural_title": "Significado Cultural",
    "about_forro.cultural_p1": "El forró es más que un simple baile; es una parte vital de la identidad cultural brasileña. La música a menudo cuenta historias de la vida rural, el amor y las luchas de la gente del noreste. Durante los festivales de junio (Festas Juninas), el forró toma el centro del escenario cuando las comunidades se reúnen para celebrar con comida, baile y música.",
    "about_forro.cultural_p2": "Hoy, el forró se ha extendido internacionalmente, con comunidades y festivales dedicados en Europa, América del Norte y más allá. Su naturaleza accesible, ritmo alegre y sentido de comunidad continúan atrayendo a nuevos entusiastas en todo el mundo.",
    "about_forro.key_figures": "Figuras Clave del Forró",
    "about_forro.key_figure_1_name": "Luiz Gonzaga",
    "about_forro.key_figure_1_desc": "Conocido como el \"Rey del Baião\", popularizó la música forró en todo Brasil",
    "about_forro.key_figure_2_name": "Dominguinhos",
    "about_forro.key_figure_2_desc": "Reconocido acordeonista y compositor que modernizó el género",
    "about_forro.key_figure_3_name": "Marinês",
    "about_forro.key_figure_3_desc": "La \"Reina del Forró\", que llevó las voces femeninas al primer plano",
    "about_forro.try_forro": "¿Quieres Probar el Forró?",
    "about_forro.try_forro_desc": "¡Únete a nuestras clases semanales y experimenta la alegría del baile forró!",
    "about_forro.see_schedule": "Ver Nuestro Horario"
  },
  "pt": {
    "about_forro.title": "Sobre o Forró",
    "about_forro.subtitle": "Descubra a rica história e significado cultural desta bela dança brasileira",
    "about_forro.origins_title": "A Origem do Forró",
    "about_forro.origins_p1": "O forró originou-se na região nordeste do Brasil e evoluiu para uma das formas de dança mais amadas do país. Acredita-se que o nome \"forró\" deriva da frase inglesa \"for all\" (para todos), referindo-se à natureza inclusiva dos bailes públicos organizados pelas companhias ferroviárias britânicas para seus trabalhadores no início do século XX.",
    "about_forro.origins_p2": "Como gênero musical, o forró abrange vários ritmos, incluindo baião, xote e arrasta-pé. O conjunto tradicional de forró, conhecido como trio nordestino, consiste em um acordeão (o instrumento principal), uma zabumba (um tipo de tambor baixo) e um triângulo de metal.",
    "about_forro.dance_style_title": "O Estilo de Dança",
    "about_forro.dance_style_p1": "A dança do forró é caracterizada por seu abraço próximo e movimentos rítmicos. Os parceiros dançam com os peitos conectados enquanto suas pernas se entrelaçam em vários padrões de passos. A dança varia de movimentos simples de dois passos a sequências complexas que envolvem giros, quedas e improvisações lúdicas.",
    "about_forro.dance_style_p2": "Existem vários estilos de dança de forró, incluindo:",
    "about_forro.dance_style_list_1_name": "Forró pé-de-serra:",
    "about_forro.dance_style_list_1_desc": "O estilo tradicional, caracterizado por passos simples e abraço próximo",
    "about_forro.dance_style_list_2_name": "Forró universitário:",
    "about_forro.dance_style_list_2_desc": "Um estilo moderno, mais elaborado, popular entre estudantes universitários",
    "about_forro.dance_style_list_3_name": "Forró eletrônico:",
    "about_forro.dance_style_list_3_desc": "Incorpora elementos de outros estilos de dança com influências da música eletrônica",
    "about_forro.cultural_title": "Significado Cultural",
    "about_forro.cultural_p1": "O forró é mais do que apenas uma dança; é uma parte vital da identidade cultural brasileira. A música geralmente conta histórias da vida rural, do amor e das lutas do povo nordestino. Durante os festivais de junho (Festas Juninas), o forró assume o centro do palco quando as comunidades se reúnem para celebrar com comida, dança e música.",
    "about_forro.cultural_p2": "Hoje, o forró se espalhou internacionalmente, com comunidades e festivais dedicados na Europa, América do Norte e além. Sua natureza acessível, ritmo alegre e senso de comunidade continuam a atrair novos entusiastas em todo o mundo.",
    "about_forro.key_figures": "Figuras Chave do Forró",
    "about_forro.key_figure_1_name": "Luiz Gonzaga",
    "about_forro.key_figure_1_desc": "Conhecido como o \"Rei do Baião\", popularizou a música forró em todo o Brasil",
    "about_forro.key_figure_2_name": "Dominguinhos",
    "about_forro.key_figure_2_desc": "Renomado acordeonista e compositor que modernizou o gênero",
    "about_forro.key_figure_3_name": "Marinês",
    "about_forro.key_figure_3_desc": "A \"Rainha do Forró\", que trouxe vozes femininas para a frente",
    "about_forro.try_forro": "Quer Experimentar o Forró?",
    "about_forro.try_forro_desc": "Junte-se às nossas aulas semanais e experimente a alegria da dança do forró!",
    "about_forro.see_schedule": "Ver Nossa Programação"
  }
}
