
{
  "en": {
    "about_forro.title": "About Forró",
    "about_forro.subtitle": "Discover the rich history and cultural significance of this beautiful Brazilian dance",
    
    "about_forro.origins_title": "1. What is Forró?",
    "about_forro.origins_p1": "Forró is a vibrant music and dance style from northeastern Brazil, deeply rooted in European, African, and Indigenous traditions. It is widely associated with festas juninas (June festivals), where people celebrate with dancing, bonfires, and music.",
    "about_forro.origins_p2": "The term \"forró\" refers to both the music genre and the social dance, which is performed in pairs and features close embraces, smooth movements, and playful improvisation.",
    
    "about_forro.dance_style_title": "2. How Does Forró Look?",
    "about_forro.dance_style_p1": "2.1 The Dance\n\nTypically danced in pairs, with close body contact or open movements, depending on the style.\n\nThe basic step is a side-to-side movement, with subtle variations.\n\nThe leader guides the follower using hand signals and body movements.\n\nThe style can be romantic and slow (xote) or fast and dynamic (arrasta-pé, pisadinha, risca-faca).",
    "about_forro.dance_style_p2": "2.2 The Music\n\nForró music is characterized by a strong rhythm and simple, catchy melodies. The traditional instrumentation includes:",
    "about_forro.dance_style_list_1_name": "Accordion",
    "about_forro.dance_style_list_1_desc": "The lead melodic instrument.",
    "about_forro.dance_style_list_2_name": "Zabumba",
    "about_forro.dance_style_list_2_desc": "A drum that provides a deep, syncopated bass rhythm.",
    "about_forro.dance_style_list_3_name": "Triangle",
    "about_forro.dance_style_list_3_desc": "Adds high-pitched percussive accents.\n\nSome modern styles incorporate electric instruments, creating variations in sound.",
    
    "about_forro.cultural_title": "3. Main Styles of Forró",
    "about_forro.cultural_p1": "Forró has different musical and dance styles, which influence its rhythm and movements.\n\n3.1 Musical Styles of Forró\n\n1. Forró Pé de Serra\n\nThe most traditional form of forró.\n\nPlayed with the classic trio (accordion, zabumba, and triangle).\n\nLyrics often talk about love, rural life, and nostalgia.\n\nKey artists: Luiz Gonzaga, Jackson do Pandeiro, Dominguinhos.\n\n2. Forró Universitário\n\nA modern version that became popular among young people.\n\nUses additional instruments like bass, guitar, and flute.\n\nKey artists: Falamansa, Bicho de Pé, Trio Virgulino.\n\n3. Forró Eletrônico\n\nUses electronic elements such as keyboards and electric guitar.\n\nKey artists: Aviões do Forró, Wesley Safadão, Calcinha Preta.\n\n4. Forró Roots\n\nA revival of pé de serra with more improvisation and musical experimentation.\n\nKey artists: Trio Alvorada, Quarteto Olinda, Os 3 do Nordeste.\n\n5. Pisadinha\n\nA modern, simplified version of forró with a strong electronic bass.\n\nHas a steady, repetitive beat, making it very danceable.\n\nKey artists: Barão da Pisadinha, Aldair Playboy.\n\n6. Risca-Faca\n\nA fast and aggressive style, often linked to street parties and intense dancing.\n\nThe lyrics are usually about jealousy, passion, and nightlife conflicts.\n\nLess common in mainstream forró but influential in regional dance scenes.",
    "about_forro.cultural_p2": "3.2 Dance Styles of Forró\n\n1. Xote\n\nThe slowest and most romantic style of forró.\n\nDanced in close embrace, with smooth, swaying movements.\n\n2. Baião\n\nThe original rhythm of forró, popularized by Luiz Gonzaga.\n\nCharacterized by syncopated beats and bouncy footwork.\n\n3. Arrasta-Pé\n\nA fast and lively dance, commonly seen at festa junina.\n\nInvolves quick footwork and energetic spins.\n\n4. Xaxado\n\nOriginally a solo dance, performed by cangaceiros (bandits of the Northeast).\n\nNow adapted into partner dancing, featuring sharp footwork.\n\n5. Rojão\n\nA very fast-paced style, similar to arrasta-pé but with even quicker steps.\n\nRequires high energy and stamina.\n\n6. Pisadinha\n\nA simplified and bouncy dance with fewer steps and a strong focus on hip movements.\n\nOften danced in a relaxed, free-flowing style.\n\n7. Risca-Faca\n\nA highly energetic dance, often performed with dramatic spins and aggressive steps.\n\nHas a rebellious and intense feel, reflecting its roots in street dance culture.",
    
    "about_forro.key_figures": "4. Where is Forró Popular?",
    "about_forro.key_figure_1_name": "4.1 In Brazil",
    "about_forro.key_figure_1_desc": "Forró is strongest in the Northeast, especially in Campina Grande (Paraíba) – Hosts the largest São João festival in the world, Caruaru (Pernambuco) – A major forró hub with deep traditions, Fortaleza (Ceará) & Natal (Rio Grande do Norte) – Strong scenes for forró eletrônico. It is also very popular in big cities like São Paulo and Rio de Janeiro, where forró universitário thrives.",
    "about_forro.key_figure_2_name": "4.2 Around the World",
    "about_forro.key_figure_2_desc": "Forró has gained popularity internationally, especially in Europe, the USA, and Japan. Cities like Paris, London, and Berlin hold forró festivals that attract dancers from all over.",
    "about_forro.key_figure_3_name": "",
    "about_forro.key_figure_3_desc": "",
    
    "about_forro.try_forro": "Want to Try Forró?",
    "about_forro.try_forro_desc": "Join our weekly classes and experience the joy of forró dancing!",
    "about_forro.see_schedule": "See Our Schedule"
  },
  "es": {
    "about_forro.title": "Sobre Forró",
    "about_forro.subtitle": "Descubre la rica historia y significado cultural de este hermoso baile brasileño",
    "about_forro.origins_title": "Los Orígenes del Forró",
    "about_forro.origins_p1": "El forró se originó en la región noreste de Brasil y ha evolucionado hasta convertirse en una de las formas de baile más queridas del país. Se cree que el nombre \"forró\" deriva de la frase inglesa \"for all\" (para todos), refiriéndose a la naturaleza inclusiva de los bailes públicos organizados por las compañías ferroviarias británicas para sus trabajadores a principios del siglo XX.",
    "about_forro.origins_p2": "Como género musical, el forró abarca varios ritmos, incluyendo baião, xote y arrasta-pé. El conjunto tradicional de forró, conocido como trio nordestino, consta de un acordeón (el instrumento principal), una zabumba (un tipo de tambor bajo) y un triángulo metálico.",
    "about_forro.dance_style_title": "El Estilo de Baile",
    "about_forro.dance_style_p1": "El baile forró se caracteriza por su abrazo cercano y movimientos rítmicos. Las parejas bailan con los pechos conectados mientras sus piernas se entrelazan en varios patrones de pasos. El baile va desde movimientos simples de dos pasos hasta secuencias complejas que involucran giros, caídas e improvisaciones lúdicas.",
    "about_forro.dance_style_p2": "Hay varios estilos de baile forró, incluyendo:",
    "about_forro.dance_style_list_1_name": "Forró pé-de-serra:",
    "about_forro.dance_style_list_1_desc": "El estilo tradicional, caracterizado por pasos simples y abrazo cercano",
    "about_forro.dance_style_list_2_name": "Forró universitário:",
    "about_forro.dance_style_list_2_desc": "Un estilo moderno, más elaborado, popular entre estudiantes universitarios",
    "about_forro.dance_style_list_3_name": "Forró eletrônico:",
    "about_forro.dance_style_list_3_desc": "Incorpora elementos de otros estilos de baile con influencias de música electrónica",
    "about_forro.cultural_title": "Significado Cultural",
    "about_forro.cultural_p1": "El forró es más que un simple baile; es una parte vital de la identidad cultural brasileña. La música a menudo cuenta historias de la vida rural, el amor y las luchas de la gente del noreste. Durante los festivales de junio (Festas Juninas), el forró toma el centro del escenario cuando las comunidades se reúnen para celebrar con comida, baile y música.",
    "about_forro.cultural_p2": "Hoy, el forró se ha extendido internacionalmente, con comunidades y festivales dedicados en Europa, América del Norte y más allá. Su naturaleza accesible, ritmo alegre y sentido de comunidad continúan atrayendo a nuevos entusiastas en todo el mundo.",
    "about_forro.key_figures": "Figuras Clave del Forró",
    "about_forro.key_figure_1_name": "Luiz Gonzaga",
    "about_forro.key_figure_1_desc": "Conocido como el \"Rey del Baião\", popularizó la música forró en todo Brasil",
    "about_forro.key_figure_2_name": "Dominguinhos",
    "about_forro.key_figure_2_desc": "Reconocido acordeonista y compositor que modernizó el género",
    "about_forro.key_figure_3_name": "Marinês",
    "about_forro.key_figure_3_desc": "La \"Reina del Forró\", que llevó las voces femeninas al primer plano",
    "about_forro.try_forro": "¿Quieres Probar el Forró?",
    "about_forro.try_forro_desc": "¡Únete a nuestras clases semanales y experimenta la alegría del baile forró!",
    "about_forro.see_schedule": "Ver Nuestro Horario"
  },
  "pt": {
    "about_forro.title": "Sobre o Forró",
    "about_forro.subtitle": "Descubra a rica história e significado cultural desta bela dança brasileira",
    "about_forro.origins_title": "A Origem do Forró",
    "about_forro.origins_p1": "O forró originou-se na região nordeste do Brasil e evoluiu para uma das formas de dança mais amadas do país. Acredita-se que o nome \"forró\" deriva da frase inglesa \"for all\" (para todos), referindo-se à natureza inclusiva dos bailes públicos organizados pelas companhias ferroviárias britânicas para seus trabalhadores no início do século XX.",
    "about_forro.origins_p2": "Como gênero musical, o forró abrange vários ritmos, incluindo baião, xote e arrasta-pé. O conjunto tradicional de forró, conhecido como trio nordestino, consiste em um acordeão (o instrumento principal), uma zabumba (um tipo de tambor baixo) e um triângulo de metal.",
    "about_forro.dance_style_title": "O Estilo de Dança",
    "about_forro.dance_style_p1": "A dança do forró é caracterizada por seu abraço próximo e movimentos rítmicos. Os parceiros dançam com os peitos conectados enquanto suas pernas se entrelaçam em vários padrões de passos. A dança varia de movimentos simples de dois passos a sequências complexas que envolvem giros, quedas e improvisações lúdicas.",
    "about_forro.dance_style_p2": "Existem vários estilos de dança de forró, incluindo:",
    "about_forro.dance_style_list_1_name": "Forró pé-de-serra:",
    "about_forro.dance_style_list_1_desc": "O estilo tradicional, caracterizado por passos simples e abraço próximo",
    "about_forro.dance_style_list_2_name": "Forró universitário:",
    "about_forro.dance_style_list_2_desc": "Um estilo moderno, mais elaborado, popular entre estudantes universitários",
    "about_forro.dance_style_list_3_name": "Forró eletrônico:",
    "about_forro.dance_style_list_3_desc": "Incorpora elementos de outros estilos de dança com influências da música eletrônica",
    "about_forro.cultural_title": "Significado Cultural",
    "about_forro.cultural_p1": "O forró é mais do que apenas uma dança; é uma parte vital da identidade cultural brasileira. A música geralmente conta histórias da vida rural, do amor e das lutas do povo nordestino. Durante os festivais de junho (Festas Juninas), o forró assume o centro do palco quando as comunidades se reúnem para celebrar com comida, dança e música.",
    "about_forro.cultural_p2": "Hoje, o forró se espalhou internacionalmente, com comunidades e festivais dedicados na Europa, América do Norte e além. Sua natureza acessível, ritmo alegre e senso de comunidade continuam a atrair novos entusiastas em todo o mundo.",
    "about_forro.key_figures": "Figuras Chave do Forró",
    "about_forro.key_figure_1_name": "Luiz Gonzaga",
    "about_forro.key_figure_1_desc": "Conhecido como o \"Rei do Baião\", popularizou a música forró em todo o Brasil",
    "about_forro.key_figure_2_name": "Dominguinhos",
    "about_forro.key_figure_2_desc": "Renomado acordeonista e compositor que modernizou o gênero",
    "about_forro.key_figure_3_name": "Marinês",
    "about_forro.key_figure_3_desc": "A \"Rainha do Forró\", que trouxe vozes femininas para a frente",
    "about_forro.try_forro": "Quer Experimentar o Forró?",
    "about_forro.try_forro_desc": "Junte-se às nossas aulas semanais e experimente a alegria da dança do forró!",
    "about_forro.see_schedule": "Ver Nossa Programação"
  }
}
