
{
  "en": {
    "events.title": "Events",
    "events.upcoming": "Upcoming Events",
    "events.past": "Past Events",
    "events.register": "Register",
    "events.learn_more": "Learn More",
    "events.no_events": "No events scheduled at the moment",
    
    "events.weekly_prostor_title": "Weekly Events in Prostor",
    "events.weekly_when": "When: Every Wednesday from 19:30 to 22:00.",
    "events.weekly_format": "Format: A short workshop for beginners at the beginning, followed by social dancing.",
    "events.weekly_after": "After-event: We stay until 23:00 in the café for socializing.",
    "events.weekly_summer": "Summer Schedule: The event happens every two weeks (check our calendar for exact dates).",
    "events.weekly_rules": "Rules: Please follow our event rules. Respect for others and maintaining appropriate dance etiquette is essential.",
    "events.weekly_contribution": "Contribution: Donation-based. Contributions are not mandatory, but they help sustain the event.",
    
    "events.letna_title": "Weekly Events in Letná",
    "events.letna_when": "When: Every two weeks from 18:30 to 23:00 (only during warm summer days).",
    "events.letna_where": "Where: On the stairs behind the Metronome.",
    "events.letna_schedule": "Schedule: Check our calendar for specific dates.",
    "events.letna_rules": "Rules: Please follow outdoor event guidelines. Be respectful of the space and other people in the area.",
    
    "events.concerts_title": "Concerts of Três Corações",
    "events.concerts_description": "Recently, they have had events on Saturdays at Papas Bar and occasionally at Dorado Café.",
    "events.concerts_schedule": "Schedule: Check our calendar for upcoming dates.",
    "events.concerts_entrance": "Entrance: Paid entry.",
    "events.concerts_rules": "Rules: Venue-specific rules apply. Be respectful of artists and other attendees.",
    
    "events.seasonal_title": "Seasonal Events",
    "events.seasonal_intro": "Some larger cultural events sometimes feature forró, including:",
    "events.seasonal_lusofona": "Lusófona (Portuguese language event)",
    "events.seasonal_kinobrasil": "KinoBrasil",
    "events.seasonal_brazilfest": "Brazil Fest Brno",
    "events.seasonal_festas": "Festas Juninas (various organizers, held between June and July)",
    "events.seasonal_note": "Note: We are not necessarily involved in organizing these events, and they may not always include forró. However, we support them, and when forró is part of the program, we encourage our community to participate.",
    "events.seasonal_rules": "Rules: Each event has its own guidelines. Please check the specific event details.",
    
    "events.nearby_title": "Nearby Events",
    "events.nearby_intro": "We support forró events happening in cities close to Prague, such as:",
    "events.nearby_brno": "Brno",
    "events.nearby_dresden": "Dresden",
    "events.nearby_budapest": "Budapest",
    "events.nearby_check": "Check our calendar for more details on upcoming events in these cities.",
    "events.nearby_rules": "Rules: When attending events in other cities, please respect their local communities and guidelines.",
    
    "events.custom_events_title": "Custom Events",
    "events.custom_events_description": "We are open to organize private and public events. If you are interested in having a forró workshop, performance, or class at your event, please contact us.",
    "events.custom_events_private": "Our team can provide customized forró experiences for your private gathering or public event. You can organize with us anything from short demonstrations to full workshops.",
    "events.custom_events_rules": "Rules: For custom events, we will discuss specific guidelines based on your needs and venue requirements.",
    "events.custom_events_learn_more": "Learn more about custom events",
    "events.contact_us": "Contact us for more information"
  },
  "es": {
    "events.title": "Eventos",
    "events.upcoming": "Próximos Eventos",
    "events.past": "Eventos Pasados",
    "events.register": "Registrarse",
    "events.learn_more": "Más Información",
    "events.no_events": "No hay eventos programados en este momento",
    
    "events.weekly_prostor_title": "Eventos Semanales en Prostor",
    "events.weekly_when": "Cuándo: Todos los miércoles de 19:30 a 22:00.",
    "events.weekly_format": "Formato: Un breve taller para principiantes al inicio, seguido de baile social.",
    "events.weekly_after": "Después del evento: Nos quedamos hasta las 23:00 en la cafetería para socializar.",
    "events.weekly_summer": "Horario de verano: El evento ocurre cada dos semanas (consulta nuestro calendario para fechas exactas).",
    "events.weekly_rules": "Reglas: Por favor, sigue nuestras reglas del evento. El respeto hacia los demás y mantener una etiqueta de baile apropiada es esencial.",
    "events.weekly_contribution": "Contribución: Basada en donaciones. Las contribuciones no son obligatorias, pero ayudan a mantener el evento.",
    
    "events.letna_title": "Eventos Semanales en Letná",
    "events.letna_when": "Cuándo: Cada dos semanas de 18:30 a 23:00 (solo durante días calurosos de verano).",
    "events.letna_where": "Dónde: En las escaleras detrás del Metrónomo.",
    "events.letna_schedule": "Horario: Consulta nuestro calendario para fechas específicas.",
    "events.letna_rules": "Reglas: Por favor, sigue las directrices para eventos al aire libre. Sé respetuoso con el espacio y otras personas en el área.",
    
    "events.concerts_title": "Conciertos de Três Corações",
    "events.concerts_description": "Recientemente, han tenido eventos los sábados en Papas Bar y ocasionalmente en Dorado Café.",
    "events.concerts_schedule": "Horario: Consulta nuestro calendario para próximas fechas.",
    "events.concerts_entrance": "Entrada: Pago de entrada.",
    "events.concerts_rules": "Reglas: Se aplican las reglas específicas del lugar. Sé respetuoso con los artistas y otros asistentes.",
    
    "events.seasonal_title": "Eventos Estacionales",
    "events.seasonal_intro": "Algunos eventos culturales más grandes a veces incluyen forró, entre ellos:",
    "events.seasonal_lusofona": "Lusófona (evento de lengua portuguesa)",
    "events.seasonal_kinobrasil": "KinoBrasil",
    "events.seasonal_brazilfest": "Brazil Fest Brno",
    "events.seasonal_festas": "Festas Juninas (varios organizadores, entre junio y julio)",
    "events.seasonal_note": "Nota: No necesariamente estamos involucrados en la organización de estos eventos, y puede que no siempre incluyan forró. Sin embargo, los apoyamos, y cuando el forró forma parte del programa, animamos a nuestra comunidad a participar.",
    "events.seasonal_rules": "Reglas: Cada evento tiene sus propias directrices. Por favor, revisa los detalles específicos del evento.",
    
    "events.nearby_title": "Eventos Cercanos",
    "events.nearby_intro": "Apoyamos eventos de forró que ocurren en ciudades cercanas a Praga, como:",
    "events.nearby_brno": "Brno",
    "events.nearby_dresden": "Dresden",
    "events.nearby_budapest": "Budapest",
    "events.nearby_check": "Consulta nuestro calendario para más detalles sobre próximos eventos en estas ciudades.",
    "events.nearby_rules": "Reglas: Cuando asistas a eventos en otras ciudades, respeta sus comunidades locales y directrices.",
    
    "events.custom_events_title": "Eventos Personalizados",
    "events.custom_events_description": "Estamos abiertos a organizar eventos privados y públicos. Si estás interesado en tener un taller de forró, una presentación o una clase en tu evento, contáctanos.",
    "events.custom_events_private": "Nuestro equipo puede proporcionar experiencias de forró personalizadas para tu reunión privada o evento público. Puedes organizar con nosotros desde breves demostraciones hasta talleres completos.",
    "events.custom_events_rules": "Reglas: Para eventos personalizados, discutiremos directrices específicas según tus necesidades y los requisitos del lugar.",
    "events.custom_events_learn_more": "Aprende más sobre eventos personalizados",
    "events.contact_us": "Contáctanos para más información"
  },
  "pt": {
    "events.title": "Eventos",
    "events.upcoming": "Próximos Eventos",
    "events.past": "Eventos Passados",
    "events.register": "Registrar",
    "events.learn_more": "Saiba Mais",
    "events.no_events": "Nenhum evento programado no momento",
    
    "events.weekly_prostor_title": "Eventos Semanais no Prostor",
    "events.weekly_when": "Quando: Todas as quartas-feiras das 19:30 às 22:00.",
    "events.weekly_format": "Formato: Uma breve oficina para iniciantes no começo, seguida de dança social.",
    "events.weekly_after": "Pós-evento: Ficamos até às 23:00 no café para socializar.",
    "events.weekly_summer": "Programação de Verão: O evento acontece a cada duas semanas (consulte nosso calendário para datas exatas).",
    "events.weekly_rules": "Regras: Por favor, siga nossas regras do evento. O respeito pelos outros e a manutenção de uma etiqueta de dança apropriada são essenciais.",
    "events.weekly_contribution": "Contribuição: Baseada em doação. Contribuições não são obrigatórias, mas ajudam a manter o evento.",
    
    "events.letna_title": "Eventos Semanais em Letná",
    "events.letna_when": "Quando: A cada duas semanas das 18:30 às 23:00 (apenas durante os dias quentes de verão).",
    "events.letna_where": "Onde: Nas escadas atrás do Metrônomo.",
    "events.letna_schedule": "Programação: Consulte nosso calendário para datas específicas.",
    "events.letna_rules": "Regras: Por favor, siga as diretrizes para eventos ao ar livre. Seja respeitoso com o espaço e outras pessoas na área.",
    
    "events.concerts_title": "Concertos do Três Corações",
    "events.concerts_description": "Recentemente, eles têm realizado eventos aos sábados no Papas Bar e ocasionalmente no Dorado Café.",
    "events.concerts_schedule": "Programação: Consulte nosso calendário para próximas datas.",
    "events.concerts_entrance": "Entrada: Paga.",
    "events.concerts_rules": "Regras: Aplicam-se regras específicas do local. Seja respeitoso com os artistas e outros participantes.",
    
    "events.seasonal_title": "Eventos Sazonais",
    "events.seasonal_intro": "Alguns eventos culturais maiores às vezes apresentam forró, incluindo:",
    "events.seasonal_lusofona": "Lusófona (evento de língua portuguesa)",
    "events.seasonal_kinobrasil": "KinoBrasil",
    "events.seasonal_brazilfest": "Brazil Fest Brno",
    "events.seasonal_festas": "Festas Juninas (vários organizadores, realizadas entre junho e julho)",
    "events.seasonal_note": "Nota: Não estamos necessariamente envolvidos na organização desses eventos, e eles podem nem sempre incluir forró. No entanto, os apoiamos, e quando o forró faz parte do programa, incentivamos nossa comunidade a participar.",
    "events.seasonal_rules": "Regras: Cada evento tem suas próprias diretrizes. Por favor, confira os detalhes específicos do evento.",
    
    "events.nearby_title": "Eventos Próximos",
    "events.nearby_intro": "Apoiamos eventos de forró que acontecem em cidades próximas a Praga, como:",
    "events.nearby_brno": "Brno",
    "events.nearby_dresden": "Dresden",
    "events.nearby_budapest": "Budapest",
    "events.nearby_check": "Consulte nosso calendário para mais detalhes sobre próximos eventos nessas cidades.",
    "events.nearby_rules": "Regras: Ao participar de eventos em outras cidades, respeite as comunidades locais e suas diretrizes.",
    
    "events.custom_events_title": "Eventos Personalizados",
    "events.custom_events_description": "Estamos abertos para organizar eventos privados e públicos. Se você estiver interessado em ter um workshop de forró, apresentação ou aula no seu evento, entre em contato conosco.",
    "events.custom_events_private": "Nossa equipe pode fornecer experiências de forró personalizadas para seu evento privado ou público. Você pode organizar conosco desde breves demonstrações até workshops completos.",
    "events.custom_events_rules": "Regras: Para eventos personalizados, discutiremos diretrizes específicas com base nas suas necessidades e requisitos do local.",
    "events.custom_events_learn_more": "Saiba mais sobre eventos personalizados",
    "events.contact_us": "Entre em contato para mais informações"
  },
  "sk": {
    "events.title": "Podujatia",
    "events.upcoming": "Nadchádzajúce podujatia",
    "events.past": "Minulé podujatia",
    "events.register": "Registrovať sa",
    "events.learn_more": "Dozvedieť sa viac",
    "events.no_events": "Momentálne nie sú naplánované žiadne podujatia",
    
    "events.weekly_prostor_title": "Týždenné podujatia v Prostoru",
    "events.weekly_when": "Kedy: Každú stredu od 19:30 do 22:00.",
    "events.weekly_format": "Formát: Krátky workshop pre začiatočníkov na začiatku, po ktorom nasleduje spoločenský tanec.",
    "events.weekly_after": "Po podujatí: Zostávame do 23:00 v kaviarni na spoločenské stretnutie.",
    "events.weekly_summer": "Letný rozvrh: Podujatie sa koná každé dva týždne (pre presné dátumy si pozrite náš kalendár).",
    "events.weekly_rules": "Pravidlá: Dodržiavajte prosím naše pravidlá podujatia. Rešpekt k ostatným a udržiavanie vhodnej tanečnej etikety je nevyhnutné.",
    "events.weekly_contribution": "Príspevok: Na základe dobrovoľných príspevkov. Príspevky nie sú povinné, ale pomáhajú udržať podujatie.",
    
    "events.letna_title": "Týždenné podujatia v Letnej",
    "events.letna_when": "Kedy: Každé dva týždne od 18:30 do 23:00 (len počas teplých letných dní).",
    "events.letna_where": "Kde: Na schodoch za Metronomom.",
    "events.letna_schedule": "Program: Pozrite si náš kalendár pre konkrétne termíny.",
    "events.letna_rules": "Pravidlá: Dodržiavajte prosím pokyny pre vonkajšie podujatia. Buďte ohľaduplní k priestoru a ostatným ľuďom v okolí.",
    
    "events.concerts_title": "Koncerty Três Corações",
    "events.concerts_description": "V poslednej dobe mali podujatia v sobotu v Papas Bar a príležitostne v Dorado Café.",
    "events.concerts_schedule": "Program: Pozrite si náš kalendár pre nadchádzajúce termíny.",
    "events.concerts_entrance": "Vstup: Platený vstup.",
    "events.concerts_rules": "Pravidlá: Platia pravidlá špecifické pre dané miesto. Buďte ohľaduplní k umelcom a ostatným účastníkom.",
    
    "events.seasonal_title": "Sezónne podujatia",
    "events.seasonal_intro": "Niektoré väčšie kultúrne podujatia niekedy zahŕňajú forró, vrátane:",
    "events.seasonal_lusofona": "Lusófona (portugalská jazyková udalosť)",
    "events.seasonal_kinobrasil": "KinoBrasil",
    "events.seasonal_brazilfest": "Brazil Fest Brno",
    "events.seasonal_festas": "Festas Juninas (rôzni organizátori, konajú sa medzi júnom a júlom)",
    "events.seasonal_note": "Poznámka: Nie sme nevyhnutne zapojení do organizácie týchto podujatí a nemusia vždy zahŕňať forró. Avšak podporujeme ich, a keď je forró súčasťou programu, povzbudzujeme našu komunitu k účasti.",
    "events.seasonal_rules": "Pravidlá: Každé podujatie má svoje vlastné smernice. Pozrite si prosím konkrétne detaily podujatia.",
    
    "events.nearby_title": "Podujatia v okolí",
    "events.nearby_intro": "Podporujeme forró podujatia konajúce sa v mestách blízko Prahy, ako napríklad:",
    "events.nearby_brno": "Brno",
    "events.nearby_dresden": "Drážďany",
    "events.nearby_budapest": "Budapešť",
    "events.nearby_check": "Pozrite si náš kalendár pre viac detailov o nadchádzajúcich podujatiach v týchto mestách.",
    "events.nearby_rules": "Pravidlá: Pri účasti na podujatiach v iných mestách rešpektujte prosím ich miestne komunity a smernice.",
    
    "events.custom_events_title": "Vlastné podujatia",
    "events.custom_events_description": "Sme otvorení organizovať súkromné a verejné podujatia. Ak máte záujem o forró workshop, vystúpenie alebo lekciu na vašom podujatí, kontaktujte nás.",
    "events.custom_events_private": "Náš tím môže poskytnúť prispôsobené forró zážitky pre vaše súkromné stretnutie alebo verejné podujatie. Môžete s nami organizovať čokoľvek od krátkych ukážok až po plnohodnotné workshopy.",
    "events.custom_events_rules": "Pravidlá: Pre vlastné podujatia prediskutujeme konkrétne smernice na základe vašich potrieb a požiadaviek miesta konania.",
    "events.custom_events_learn_more": "Dozvedieť sa viac o vlastných podujatiach",
    "events.contact_us": "Kontaktujte nás pre viac informácií"
  },
  "ua": {
    "events.title": "Події",
    "events.upcoming": "Майбутні події",
    "events.past": "Минулі події",
    "events.register": "Зареєструватися",
    "events.learn_more": "Дізнатися більше",
    "events.no_events": "На даний момент немає запланованих подій",
    
    "events.weekly_prostor_title": "Щотижневі події в Просторі",
    "events.weekly_when": "Коли: Щосереди з 19:30 до 22:00.",
    "events.weekly_format": "Формат: Короткий майстер-клас для початківців на початку, після чого слідує соціальний танець.",
    "events.weekly_after": "Після події: Ми залишаємося до 23:00 в кафе для спілкування.",
    "events.weekly_summer": "Літній розклад: Подія відбувається кожні два тижні (перевірте наш календар для точних дат).",
    "events.weekly_rules": "Правила: Будь ласка, дотримуйтесь наших правил заходу. Повага до інших і підтримка відповідного танцювального етикету є необхідними.",
    "events.weekly_contribution": "Внесок: На основі пожертвувань. Внески не є обов'язковими, але вони допомагають підтримувати захід.",
    
    "events.letna_title": "Щотижневі події в Летні",
    "events.letna_when": "Коли: Кожні два тижні з 18:30 до 23:00 (лише під час теплих літніх днів).",
    "events.letna_where": "Де: На сходах за Метрономом.",
    "events.letna_schedule": "Розклад: Перевірте наш календар для конкретних дат.",
    "events.letna_rules": "Правила: Будь ласка, дотримуйтесь вказівок для заходів на відкритому повітрі. Поважайте простір та інших людей у районі.",
    
    "events.concerts_title": "Концерти Três Corações",
    "events.concerts_description": "Нещодавно вони проводили заходи по суботах у Papas Bar і іноді в Dorado Café.",
    "events.concerts_schedule": "Розклад: Перевірте наш календар для майбутніх дат.",
    "events.concerts_entrance": "Вхід: Платний вхід.",
    "events.concerts_rules": "Правила: Застосовуються правила, специфічні для місця проведення. Поважайте артистів та інших відвідувачів.",
    
    "events.seasonal_title": "Сезонні події",
    "events.seasonal_intro": "Деякі більші культурні заходи іноді включають форро, в тому числі:",
    "events.seasonal_lusofona": "Lusófona (захід португальської мови)",
    "events.seasonal_kinobrasil": "KinoBrasil",
    "events.seasonal_brazilfest": "Brazil Fest Brno",
    "events.seasonal_festas": "Festas Juninas (різні організатори, проводяться між червнем і липнем)",
    "events.seasonal_note": "Примітка: Ми не обов'язково беремо участь в організації цих подій, і вони можуть не завжди включати форро. Однак ми підтримуємо їх, і коли форро є частиною програми, ми заохочуємо нашу спільноту брати участь.",
    "events.seasonal_rules": "Правила: Кожна подія має свої власні інструкції. Будь ласка, перевірте конкретні деталі події.",
    
    "events.nearby_title": "Події поблизу",
    "events.nearby_intro": "Ми підтримуємо події форро, що відбуваються в містах поблизу Праги, таких як:",
    "events.nearby_brno": "Брно",
    "events.nearby_dresden": "Дрезден",
    "events.nearby_budapest": "Будапешт",
    "events.nearby_check": "Перевірте наш календар для більш детальної інформації про майбутні події в цих містах.",
    "events.nearby_rules": "Правила: При відвідуванні подій в інших містах, будь ласка, поважайте їхні місцеві спільноти та керівні принципи.",
    
    "events.custom_events_title": "Індивідуальні події",
    "events.custom_events_description": "Ми відкриті для організації приватних та публічних заходів. Якщо ви зацікавлені в проведенні майстер-класу форро, виступу чи класу на вашому заході, зв'яжіться з нами.",
    "events.custom_events_private": "Наша команда може надати індивідуальні враження від форро для вашої приватної зустрічі або публічного заходу. Ви можете організувати з нами що завгодно, від коротких демонстрацій до повних майстер-класів.",
    "events.custom_events_rules": "Правила: Для індивідуальних подій ми обговоримо конкретні вказівки на основі ваших потреб і вимог місця проведення.",
    "events.custom_events_learn_more": "Дізнатися більше про індивідуальні події",
    "events.contact_us": "Зв'яжіться з нами для отримання додаткової інформації"
  }
}
