
{
  "en": {
    "partners.title": "Our Partners",
    "partners.subtitle": "Working together to promote dance culture",
    "partners.become_partner": "Become a Partner",
    "partners.contact_us": "Contact Us for Partnership",
    "partners.no_partners": "Currently seeking new partnerships",
    "partners.about": "About Us - Forrozeiros Prague",
    "partners.description": "Forrozeiros Prague is a community that organizes events, workshops, and gatherings to promote forró in Prague. Over the years, the organization and the people involved have changed, and today we hold a weekly event at Komunitní Prostor Smíchov. In the summer, we meet at Letná Park.",
    "partners.events": "We support and promote events from our partners in Prague and the surrounding region, including concerts by Três Corações (recently at Papas Bar and Dorado Café) and classes by local forró teachers.",
    "partners.goals": "Our goal is to spread forró, bring in new people, and help the community grow. We aim to improve dancers' skills, support teachers in finding students, and connect audiences with forró bands. Our objective is to develop a strong and sustainable forró community in Prague, leading to the establishment of forró festivals in the city."
  },
  "es": {
    "partners.title": "Nuestros Socios",
    "partners.subtitle": "Trabajando juntos para promover la cultura del baile",
    "partners.become_partner": "Conviértete en Socio",
    "partners.contact_us": "Contáctanos para Asociarte",
    "partners.no_partners": "Actualmente buscando nuevas asociaciones",
    "partners.about": "Sobre Nosotros - Forrozeiros Praga",
    "partners.description": "Forrozeiros Praga es una comunidad que organiza eventos, talleres y reuniones para promover el forró en Praga. Con el paso de los años, la organización y las personas involucradas han cambiado, y hoy realizamos un evento semanal en Komunitní Prostor Smíchov. En verano, nos reunimos en el Parque Letná.",
    "partners.events": "Apoyamos y promovemos eventos de nuestros socios en Praga y la región circundante, incluidos conciertos de Três Corações (recientemente en Papas Bar y Dorado Café) y clases de profesores locales de forró.",
    "partners.goals": "Nuestro objetivo es difundir el forró, atraer nuevas personas y ayudar a la comunidad a crecer. Buscamos mejorar las habilidades de los bailarines, apoyar a los profesores a encontrar estudiantes y conectar al público con bandas de forró. Nuestro objetivo es desarrollar una comunidad de forró fuerte y sostenible en Praga, que lleve al establecimiento de festivales de forró en la ciudad."
  },
  "pt": {
    "partners.title": "Nossos Parceiros",
    "partners.subtitle": "Trabalhando juntos para promover a cultura da dança",
    "partners.become_partner": "Torne-se um Parceiro",
    "partners.contact_us": "Contate-nos para Parcerias",
    "partners.no_partners": "Atualmente buscando novas parcerias",
    "partners.about": "Sobre Nós - Forrozeiros Praga",
    "partners.description": "Forrozeiros Praga é uma comunidade que organiza eventos, workshops e encontros para promover o forró em Praga. Ao longo dos anos, a organização e as pessoas envolvidas mudaram, e hoje realizamos um evento semanal no Komunitní Prostor Smíchov. No verão, nos encontramos no Parque Letná.",
    "partners.events": "Apoiamos e promovemos eventos de nossos parceiros em Praga e na região circundante, incluindo shows do Três Corações (recentemente no Papas Bar e Dorado Café) e aulas de professores locais de forró.",
    "partners.goals": "Nosso objetivo é disseminar o forró, trazer novas pessoas e ajudar a comunidade a crescer. Buscamos melhorar as habilidades dos dançarinos, apoiar professores a encontrar alunos e conectar o público com bandas de forró. Nosso objetivo é desenvolver uma comunidade de forró forte e sustentável em Praga, levando ao estabelecimento de festivais de forró na cidade."
  }
}
