{
  "en": {
    "rules.title": "Our Rules",
    "rules.subtitle": "Guidelines to ensure a safe, respectful, and enjoyable experience for everyone",
    "rules.community_guidelines": "Community Guidelines",
    "rules.community_description": "At DanceEvent, we foster a community based on respect, inclusivity, and shared joy of dance. Our guidelines help maintain a positive environment where everyone feels welcome and safe.",
    "rules.respect_consent": "Respect and Consent",
    "rules.respect.item1": "Always ask before dancing with someone and respect their decision if they decline.",
    "rules.respect.item2": "Maintain appropriate physical contact during dances. If you're unsure about a move or hold, ask first.",
    "rules.respect.item3": "Listen to your partner's feedback and adjust accordingly.",
    "rules.respect.item4": "Anyone can end a dance at any time without explanation.",
    "rules.respect.item5": "Report any uncomfortable situations to our staff immediately.",
    "rules.floor_etiquette": "Floor Etiquette",
    "rules.floor.item1": "Be aware of your surroundings and other dancers on the floor.",
    "rules.floor.item2": "Adapt your movements to the available space—save larger movements for when the floor is less crowded.",
    "rules.floor.item3": "Follow the general counter-clockwise flow of the dance floor when applicable.",
    "rules.floor.item4": "If a collision occurs, check that everyone is okay and apologize before continuing.",
    "rules.floor.item5": "In crowded conditions, prioritize safety over elaborate movements.",
    "rules.inclusivity": "Inclusivity",
    "rules.inclusivity.item1": "We welcome dancers of all backgrounds, identities, ages, and skill levels.",
    "rules.inclusivity.item2": "Experienced dancers are encouraged to dance with beginners and provide supportive guidance.",
    "rules.inclusivity.item3": "Discriminatory language or behavior of any kind will not be tolerated.",
    "rules.inclusivity.item4": "We encourage role-switching and learning both lead and follow positions.",
    "rules.inclusivity.item5": "Be patient and supportive of those who are learning.",
    "rules.hygiene": "Personal Hygiene and Attire",
    "rules.hygiene.item1": "Come to events freshly showered and wearing deodorant.",
    "rules.hygiene.item2": "Bring a change of clothes or extra shirts if you tend to perspire heavily.",
    "rules.hygiene.item3": "Wear comfortable, clean clothing appropriate for movement.",
    "rules.hygiene.item4": "Choose footwear that won't damage the dance floor (avoid street shoes with dirt or rubber soles that may mark the floor).",
    "rules.hygiene.item5": "Consider bringing a hand towel for personal use.",
    "rules.conduct": "General Conduct",
    "rules.conduct.item1": "Arrive on time for classes and respect the instructor's guidance.",
    "rules.conduct.item2": "Excessive alcohol consumption is discouraged—please drink responsibly.",
    "rules.conduct.item3": "Photography and video at events should be consensual. Ask before taking pictures of others.",
    "rules.conduct.item4": "Support the event by paying the appropriate entry fees.",
    "rules.conduct.item5": "Help build our community by welcoming newcomers and creating a positive atmosphere.",
    "rules.violations": "Consequences for Rule Violations",
    "rules.violations_description": "We take these guidelines seriously to ensure everyone's safety and enjoyment. Violations will be addressed as follows:",
    "rules.first_occurrence": "First Occurrence:",
    "rules.first_occurrence_description": "A verbal reminder about our community guidelines.",
    "rules.second_occurrence": "Second Occurrence:",
    "rules.second_occurrence_description": "A formal warning and potential temporary removal from the current event.",
    "rules.serious_violations": "Serious or Repeated Violations:",
    "rules.serious_violations_description": "Suspension from future events or permanent exclusion from our community.",
    "rules.immediate_ejection": "Immediate Ejection:",
    "rules.immediate_ejection_description": "Severe violations such as harassment, threatening behavior, or endangering others will result in immediate removal with no refund.",
    "rules.reporting": "Reporting Concerns",
    "rules.reporting_description": "If you experience or witness behavior that violates these guidelines, please report it immediately to any staff member or event organizer. You can also contact us directly at:",
    "rules.reporting_email": "Email: safety@danceevent.com",
    "rules.reporting_phone": "Phone: (123) 456-7890",
    "rules.reporting_confidential": "All reports will be handled confidentially, and appropriate action will be taken."
  },
  "es": {
    "rules.title": "Nuestras Reglas",
    "rules.subtitle": "Directrices para garantizar una experiencia segura, respetuosa y agradable para todos",
    "rules.community_guidelines": "Directrices de la Comunidad",
    "rules.community_description": "En DanceEvent, fomentamos una comunidad basada en el respeto, la inclusión y la alegría compartida del baile. Nuestras directrices ayudan a mantener un ambiente positivo donde todos se sientan bienvenidos y seguros.",
    "rules.respect_consent": "Respeto y Consentimiento",
    "rules.respect.item1": "Siempre pide permiso antes de bailar con alguien y respeta su decisión si se niega.",
    "rules.respect.item2": "Mantén un contacto físico apropiado durante los bailes. Si no estás seguro sobre un movimiento o posición, pregunta primero.",
    "rules.respect.item3": "Escucha los comentarios de tu pareja y ajústate en consecuencia.",
    "rules.respect.item4": "Cualquiera puede terminar un baile en cualquier momento sin explicación.",
    "rules.respect.item5": "Reporta cualquier situación incómoda a nuestro personal inmediatamente.",
    "rules.floor_etiquette": "Etiqueta en la Pista",
    "rules.floor.item1": "Sé consciente de tu entorno y de los otros bailarines en la pista.",
    "rules.floor.item2": "Adapta tus movimientos al espacio disponible—guarda los movimientos más grandes para cuando la pista esté menos concurrida.",
    "rules.floor.item3": "Sigue el flujo general en sentido contrario a las agujas del reloj cuando sea aplicable.",
    "rules.floor.item4": "Si ocurre una colisión, asegúrate de que todos estén bien y pide disculpas antes de continuar.",
    "rules.floor.item5": "En condiciones de aglomeración, prioriza la seguridad sobre los movimientos elaborados.",
    "rules.inclusivity": "Inclusividad",
    "rules.inclusivity.item1": "Damos la bienvenida a bailarines de todos los orígenes, identidades, edades y niveles de habilidad.",
    "rules.inclusivity.item2": "Se anima a los bailarines experimentados a bailar con principiantes y proporcionar orientación de apoyo.",
    "rules.inclusivity.item3": "No se tolerará ningún tipo de lenguaje o comportamiento discriminatorio.",
    "rules.inclusivity.item4": "Fomentamos el cambio de roles y el aprendizaje tanto de las posiciones de guía como de seguimiento.",
    "rules.inclusivity.item5": "Sé paciente y apoya a aquellos que están aprendiendo.",
    "rules.hygiene": "Higiene Personal y Vestimenta",
    "rules.hygiene.item1": "Asiste a los eventos recién duchado y usando desodorante.",
    "rules.hygiene.item2": "Lleva un cambio de ropa o camisetas extra si tiendes a transpirar mucho.",
    "rules.hygiene.item3": "Usa ropa cómoda y limpia, apropiada para el movimiento.",
    "rules.hygiene.item4": "Elige calzado que no dañe el suelo de baile (evita zapatos de calle con suciedad o suelas de goma que puedan marcar el suelo).",
    "rules.hygiene.item5": "Considera llevar una toalla de mano para uso personal.",
    "rules.conduct": "Conducta General",
    "rules.conduct.item1": "Llega a tiempo a las clases y respeta las indicaciones del instructor.",
    "rules.conduct.item2": "Se desaconseja el consumo excesivo de alcohol—por favor, bebe responsablemente.",
    "rules.conduct.item3": "La fotografía y el video en eventos deben ser consensuados. Pregunta antes de tomar fotos de otros.",
    "rules.conduct.item4": "Apoya el evento pagando las cuotas de entrada correspondientes.",
    "rules.conduct.item5": "Ayuda a construir nuestra comunidad dando la bienvenida a los recién llegados y creando una atmósfera positiva.",
    "rules.violations": "Consecuencias por Incumplimiento de las Reglas",
    "rules.violations_description": "Tomamos estas directrices seriamente para garantizar la seguridad y el disfrute de todos. Las violaciones se abordarán de la siguiente manera:",
    "rules.first_occurrence": "Primera Ocurrencia:",
    "rules.first_occurrence_description": "Un recordatorio verbal sobre nuestras directrices comunitarias.",
    "rules.second_occurrence": "Segunda Ocurrencia:",
    "rules.second_occurrence_description": "Una advertencia formal y posible retirada temporal del evento actual.",
    "rules.serious_violations": "Violaciones Graves o Repetidas:",
    "rules.serious_violations_description": "Suspensión de eventos futuros o exclusión permanente de nuestra comunidad.",
    "rules.immediate_ejection": "Expulsión Inmediata:",
    "rules.immediate_ejection_description": "Violaciones graves como acoso, comportamiento amenazante o poner en peligro a otros resultarán en la retirada inmediata sin reembolso.",
    "rules.reporting": "Cómo Reportar Problemas",
    "rules.reporting_description": "Si experimentas o presencias un comportamiento que viola estas directrices, por favor repórtalo inmediatamente a cualquier miembro del personal u organizador del evento. También puedes contactarnos directamente en:",
    "rules.reporting_email": "Email: safety@danceevent.com",
    "rules.reporting_phone": "Teléfono: (123) 456-7890",
    "rules.reporting_confidential": "Todos los reportes serán tratados confidencialmente, y se tomarán las medidas apropiadas."
  },
  "pt": {
    "rules.title": "Nossas Regras",
    "rules.subtitle": "Diretrizes para garantir uma experiência segura, respeitosa e agradável para todos",
    "rules.community_guidelines": "Diretrizes da Comunidade",
    "rules.community_description": "Na DanceEvent, promovemos uma comunidade baseada no respeito, inclusão e alegria compartilhada da dança. Nossas diretrizes ajudam a manter um ambiente positivo onde todos se sintam bem-vindos e seguros.",
    "rules.respect_consent": "Respeito e Consentimento",
    "rules.respect.item1": "Sempre pergunte antes de dançar com alguém e respeite a decisão se recusarem.",
    "rules.respect.item2": "Mantenha contato físico apropriado durante as danças. Se você não tiver certeza sobre um movimento ou posição, pergunte primeiro.",
    "rules.respect.item3": "Ouça o feedback do seu parceiro e ajuste-se de acordo.",
    "rules.respect.item4": "Qualquer pessoa pode terminar uma dança a qualquer momento sem explicação.",
    "rules.respect.item5": "Reporte qualquer situação desconfortável à nossa equipe imediatamente.",
    "rules.floor_etiquette": "Etiqueta na Pista",
    "rules.floor.item1": "Esteja ciente do seu entorno e de outros dançarinos na pista.",
    "rules.floor.item2": "Adapte seus movimentos ao espaço disponível—guarde os movimentos maiores para quando a pista estiver menos lotada.",
    "rules.floor.item3": "Siga o fluxo geral no sentido anti-horário quando aplicável.",
    "rules.floor.item4": "Se ocorrer uma colisão, certifique-se de que todos estão bem e peça desculpas antes de continuar.",
    "rules.floor.item5": "Em condições de aglomeração, priorize a segurança sobre os movimentos elaborados.",
    "rules.inclusivity": "Inclusão",
    "rules.inclusivity.item1": "Damos as boas-vindas a dançarinos de todas as origens, identidades, idades e níveis de habilidade.",
    "rules.inclusivity.item2": "Dançarinos experientes são encorajados a dançar com iniciantes e fornecer orientação de apoio.",
    "rules.inclusivity.item3": "Nenhum tipo de linguagem ou comportamento discriminatório será tolerado.",
    "rules.inclusivity.item4": "Incentivamos a troca de papéis e o aprendizado das posições de liderança e de seguidor.",
    "rules.inclusivity.item5": "Seja paciente e apoie aqueles que estão aprendendo.",
    "rules.hygiene": "Higiene Pessoal e Vestuário",
    "rules.hygiene.item1": "Compareça aos eventos recém-banhado e usando desodorante.",
    "rules.hygiene.item2": "Leve uma troca de roupa ou camisetas extras se você tende a transpirar muito.",
    "rules.hygiene.item3": "Use roupas confortáveis e limpas, adequadas para o movimento.",
    "rules.hygiene.item4": "Escolha calçados que não danifiquem o piso de dança (evite sapatos de rua com sujeira ou solas de borracha que possam marcar o piso).",
    "rules.hygiene.item5": "Considere levar uma toalha de mão para uso pessoal.",
    "rules.conduct": "Conduta Geral",
    "rules.conduct.item1": "Chegue às aulas no horário e respeite as instruções do instrutor.",
    "rules.conduct.item2": "O consumo excessivo de álcool é desencorajado—por favor, beba com responsabilidade.",
    "rules.conduct.item3": "A fotografia e o vídeo em eventos devem ser consensuais. Pergunte antes de tirar fotos de outros.",
    "rules.conduct.item4": "Apoie o evento pagando as taxas de entrada correspondentes.",
    "rules.conduct.item5": "Ajude a construir nossa comunidade, dando as boas-vindas aos recém-chegados e criando uma atmosfera positiva.",
    "rules.violations": "Consequências por Violação das Regras",
    "rules.violations_description": "Levamos estas diretrizes a sério para garantir a segurança e o prazer de todos. As violações serão tratadas da seguinte forma:",
    "rules.first_occurrence": "Primeira Ocorrência:",
    "rules.first_occurrence_description": "Um lembrete verbal sobre nossas diretrizes comunitárias.",
    "rules.second_occurrence": "Segunda Ocorrência:",
    "rules.second_occurrence_description": "Um aviso formal e potencial remoção temporária do evento atual.",
    "rules.serious_violations": "Violações Graves ou Repetidas:",
    "rules.serious_violations_description": "Suspensão de eventos futuros ou exclusão permanente de nossa comunidade.",
    "rules.immediate_ejection": "Expulsão Imediata:",
    "rules.immediate_ejection_description": "Violações graves, como assédio, comportamento ameaçador ou colocar outros em perigo, resultarão na remoção imediata sem reembolso.",
    "rules.reporting": "Como Reportar Problemas",
    "rules.reporting_description": "Se você vivenciar ou testemunhar um comportamento que viole estas diretrizes, por favor, relate-o imediatamente a qualquer membro da equipe ou organizador do evento. Você também pode entrar em contato conosco diretamente em:",
    "rules.reporting_email": "Email: safety@danceevent.com",
    "rules.reporting_phone": "Telefone: (123) 456-7890",
    "rules.reporting_confidential": "Todos os relatórios serão tratados confidencialmente, e as medidas apropriadas serão tomadas."
  }
}
