
{
  "en": {
    "rules.title": "Our Rules",
    "rules.subtitle": "Guidelines to ensure a safe, respectful, and enjoyable experience for everyone",
    "rules.general_rules": "Rules of the Events",
    "rules.general_description": "These rules apply to all our events and help create a welcoming and respectful environment.",
    "rules.general.item1": "Be polite and respectful. Prejudice and offensive attitudes will not be tolerated.",
    "rules.general.item2": "Be aware of what others want or don't want.",
    "rules.general.item3": "Avoid giving unsolicited dance advice.",
    "rules.general.item4": "Personal spaces and boundaries should always be respected. Persistent unwanted attention, on or off the dancefloor, is unacceptable.",
    "rules.general.item5": "If someone turns you down for a dance, it's not a personal rejection. Accept it and seek another partner.",
    "rules.general.item6": "If your partner points out discomfort or limits, adjust your behavior immediately.",
    "rules.general.item7": "Accidental touching of sensitive body parts: apologise.",
    "rules.general.item8": "Accepting an invitation to dance does not imply consent to anything else.",
    
    "rules.prostor_rules": "In Prostor",
    "rules.prostor.item1": "Drinks on the table: In the church, all drinks need to be around the table, spilling on the floor can be a problem.",
    "rules.prostor.item2": "No smoking inside, including electronic cigarettes and similar products.",
    "rules.prostor.item3": "Please remove your shoes before you enter the dance floor.",
    "rules.prostor.item4": "Support the events: Remember to sign the list, and if you can and would like to, make donations to our box or to the QR code, follow us on our social media, and invite your friends.",
    
    "rules.recommendations": "Recommendations",
    "rules.recommendations.item1": "Stay clean: Dancing in close proximity requires good hygiene habits for everyone's comfort.",
    "rules.recommendations.item2": "Be careful: Let your partner know if you are injured or uncomfortable.",
    "rules.recommendations.item3": "Contact us: If you feel uncomfortable or unsafe, seek out an organizer. Reports will be treated seriously, and harassment will result in immediate exclusion.",
    "rules.recommendations.item4": "You can end a dance at any time, even in the middle of a song.",
    "rules.recommendations.item5": "Be collaborative: Talk and dance with different people, including newbies, and contribute to a welcoming experience.",
    "rules.recommendations.item6": "Have fun and make friends :)"
  },
  "es": {
    "rules.title": "Nuestras Reglas",
    "rules.subtitle": "Directrices para garantizar una experiencia segura, respetuosa y agradable para todos",
    "rules.general_rules": "Reglas de los Eventos",
    "rules.general_description": "Estas reglas se aplican a todos nuestros eventos y ayudan a crear un ambiente acogedor y respetuoso.",
    "rules.general.item1": "Sé educado y respetuoso. No se tolerarán prejuicios ni actitudes ofensivas.",
    "rules.general.item2": "Sé consciente de lo que otros quieren o no quieren.",
    "rules.general.item3": "Evita dar consejos de baile no solicitados.",
    "rules.general.item4": "Los espacios personales y los límites siempre deben respetarse. La atención no deseada persistente, dentro o fuera de la pista de baile, es inaceptable.",
    "rules.general.item5": "Si alguien te rechaza para bailar, no es un rechazo personal. Acéptalo y busca otra pareja.",
    "rules.general.item6": "Si tu pareja señala incomodidad o límites, ajusta tu comportamiento inmediatamente.",
    "rules.general.item7": "Tocamiento accidental de partes sensibles del cuerpo: pide disculpas.",
    "rules.general.item8": "Aceptar una invitación a bailar no implica consentimiento para nada más.",
    
    "rules.prostor_rules": "En Prostor",
    "rules.prostor.item1": "Bebidas en la mesa: En la iglesia, todas las bebidas deben estar alrededor de la mesa, derramar en el suelo puede ser un problema.",
    "rules.prostor.item2": "No fumar dentro, incluidos cigarrillos electrónicos y productos similares.",
    "rules.prostor.item3": "Por favor, quítate los zapatos antes de entrar en la pista de baile.",
    "rules.prostor.item4": "Apoya los eventos: Recuerda firmar la lista, y si puedes y quieres, haz donaciones a nuestra caja o al código QR, síguenos en nuestras redes sociales e invita a tus amigos.",
    
    "rules.recommendations": "Recomendaciones",
    "rules.recommendations.item1": "Mantente limpio: Bailar en proximidad cercana requiere buenos hábitos de higiene para la comodidad de todos.",
    "rules.recommendations.item2": "Ten cuidado: Informa a tu pareja si estás lesionado o incómodo.",
    "rules.recommendations.item3": "Contáctanos: Si te sientes incómodo o inseguro, busca a un organizador. Los informes se tratarán con seriedad, y el acoso resultará en exclusión inmediata.",
    "rules.recommendations.item4": "Puedes terminar un baile en cualquier momento, incluso en medio de una canción.",
    "rules.recommendations.item5": "Sé colaborativo: Habla y baila con diferentes personas, incluyendo novatos, y contribuye a una experiencia acogedora.",
    "rules.recommendations.item6": "Diviértete y haz amigos :)"
  },
  "pt": {
    "rules.title": "Nossas Regras",
    "rules.subtitle": "Diretrizes para garantir uma experiência segura, respeitosa e agradável para todos",
    "rules.general_rules": "Regras dos Eventos",
    "rules.general_description": "Estas regras se aplicam a todos os nossos eventos e ajudam a criar um ambiente acolhedor e respeitoso.",
    "rules.general.item1": "Seja educado e respeitoso. Preconceito e atitudes ofensivas não serão tolerados.",
    "rules.general.item2": "Esteja ciente do que os outros querem ou não querem.",
    "rules.general.item3": "Evite dar conselhos de dança não solicitados.",
    "rules.general.item4": "Espaços pessoais e limites devem sempre ser respeitados. Atenção persistente indesejada, dentro ou fora da pista de dança, é inaceitável.",
    "rules.general.item5": "Se alguém recusar dançar com você, não é uma rejeição pessoal. Aceite e procure outro parceiro.",
    "rules.general.item6": "Se seu parceiro apontar desconforto ou limites, ajuste seu comportamento imediatamente.",
    "rules.general.item7": "Toque acidental em partes sensíveis do corpo: peça desculpas.",
    "rules.general.item8": "Aceitar um convite para dançar não implica em consentimento para qualquer outra coisa.",
    
    "rules.prostor_rules": "No Prostor",
    "rules.prostor.item1": "Bebidas na mesa: Na igreja, todas as bebidas precisam estar ao redor da mesa, derramar no chão pode ser um problema.",
    "rules.prostor.item2": "Não fumar dentro, incluindo cigarros eletrônicos e produtos similares.",
    "rules.prostor.item3": "Por favor, tire seus sapatos antes de entrar na pista de dança.",
    "rules.prostor.item4": "Apoie os eventos: Lembre-se de assinar a lista, e se você puder e quiser, faça doações para nossa caixa ou para o código QR, siga-nos em nossas redes sociais e convide seus amigos.",
    
    "rules.recommendations": "Recomendações",
    "rules.recommendations.item1": "Mantenha-se limpo: Dançar em proximidade requer bons hábitos de higiene para o conforto de todos.",
    "rules.recommendations.item2": "Seja cuidadoso: Informe seu parceiro se você estiver machucado ou desconfortável.",
    "rules.recommendations.item3": "Contate-nos: Se você se sentir desconfortável ou inseguro, procure um organizador. Relatos serão tratados com seriedade, e assédio resultará em exclusão imediata.",
    "rules.recommendations.item4": "Você pode encerrar uma dança a qualquer momento, mesmo no meio de uma música.",
    "rules.recommendations.item5": "Seja colaborativo: Converse e dance com diferentes pessoas, incluindo iniciantes, e contribua para uma experiência acolhedora.",
    "rules.recommendations.item6": "Divirta-se e faça amigos :)"
  },
  "sk": {
    "rules.title": "Naše pravidlá",
    "rules.subtitle": "Smernice na zabezpečenie bezpečného, úctivého a príjemného zážitku pre všetkých",
    "rules.general_rules": "Pravidlá podujatí",
    "rules.general_description": "Tieto pravidlá platia pre všetky naše podujatia a pomáhajú vytvoriť prívetivé a úctivé prostredie.",
    "rules.general.item1": "Buďte zdvorilí a úctiví. Predsudky a urážlivé správanie nebudú tolerované.",
    "rules.general.item2": "Buďte si vedomí toho, čo ostatní chcú alebo nechcú.",
    "rules.general.item3": "Vyhnite sa poskytovaniu nevyžiadaných rád ohľadom tanca.",
    "rules.general.item4": "Osobné priestory a hranice by mali byť vždy rešpektované. Vytrvalá neželaná pozornosť, na tanečnom parkete alebo mimo neho, je neprijateľná.",
    "rules.general.item5": "Ak vás niekto odmietne pre tanec, nie je to osobné odmietnutie. Prijmite to a hľadajte iného partnera.",
    "rules.general.item6": "Ak váš partner poukáže na nepohodlie alebo limity, okamžite upravte svoje správanie.",
    "rules.general.item7": "Náhodné dotyky citlivých častí tela: ospravedlňte sa.",
    "rules.general.item8": "Prijatie pozvánky na tanec neznamená súhlas s ničím iným.",
    
    "rules.prostor_rules": "V Prostoru",
    "rules.prostor.item1": "Nápoje na stole: V kostole musia byť všetky nápoje okolo stola, rozliatie na podlahu môže byť problém.",
    "rules.prostor.item2": "Zákaz fajčenia vnútri, vrátane elektronických cigariet a podobných výrobkov.",
    "rules.prostor.item3": "Pred vstupom na tanečný parket si prosím vyzujte topánky.",
    "rules.prostor.item4": "Podporujte podujatia: Nezabudnite sa podpísať do zoznamu, a ak môžete a chceli by ste, prispejte do našej pokladnice alebo cez QR kód, sledujte nás na sociálnych sieťach a pozvite svojich priateľov.",
    
    "rules.recommendations": "Odporúčania",
    "rules.recommendations.item1": "Udržujte sa čistí: Tanec v tesnej blízkosti vyžaduje dobré hygienické návyky pre pohodlie všetkých.",
    "rules.recommendations.item2": "Buďte opatrní: Informujte svojho partnera, ak ste zranení alebo sa cítite nepohodlne.",
    "rules.recommendations.item3": "Kontaktujte nás: Ak sa cítite nepríjemne alebo nebezpečne, vyhľadajte organizátora. Hlásenia budú braté vážne a obťažovanie bude mať za následok okamžité vylúčenie.",
    "rules.recommendations.item4": "Môžete ukončiť tanec kedykoľvek, aj uprostred piesne.",
    "rules.recommendations.item5": "Buďte spolupracujúci: Rozprávajte sa a tancujte s rôznymi ľuďmi, vrátane nováčikov, a prispievajte k príjemnému zážitku.",
    "rules.recommendations.item6": "Bavte sa a nájdite si priateľov :)"
  },
  "ua": {
    "rules.title": "Наші правила",
    "rules.subtitle": "Рекомендації для забезпечення безпечного, шанобливого та приємного досвіду для всіх",
    "rules.general_rules": "Правила заходів",
    "rules.general_description": "Ці правила застосовуються до всіх наших заходів і допомагають створити привітне і шанобливе середовище.",
    "rules.general.item1": "Будьте ввічливими та шанобливими. Упередження та образливе ставлення не будуть толеровані.",
    "rules.general.item2": "Усвідомлюйте, що інші хочуть або не хочуть.",
    "rules.general.item3": "Уникайте надання незапрошених порад щодо танцю.",
    "rules.general.item4": "Особистий простір і межі завжди повинні поважатися. Наполеглива небажана увага, на танцмайданчику чи поза ним, є неприйнятною.",
    "rules.general.item5": "Якщо хтось відмовляє вам у танці, це не особисте відхилення. Прийміть це і шукайте іншого партнера.",
    "rules.general.item6": "Якщо ваш партнер вказує на дискомфорт або обмеження, негайно коригуйте свою поведінку.",
    "rules.general.item7": "Випадкове торкання чутливих частин тіла: вибачтеся.",
    "rules.general.item8": "Прийняття запрошення на танець не означає згоди на щось інше.",
    
    "rules.prostor_rules": "В Просторі",
    "rules.prostor.item1": "Напої на столі: У церкві всі напої повинні бути навколо столу, розлиття на підлогу може бути проблемою.",
    "rules.prostor.item2": "Заборонено курити всередині, включаючи електронні сигарети та подібні продукти.",
    "rules.prostor.item3": "Будь ласка, зніміть взуття перед входом на танцювальний майданчик.",
    "rules.prostor.item4": "Підтримуйте заходи: Пам'ятайте підписати список, і якщо можете і хочете, робіть пожертви в нашу скриньку або на QR-код, слідкуйте за нами в соціальних мережах та запрошуйте своїх друзів.",
    
    "rules.recommendations": "Рекомендації",
    "rules.recommendations.item1": "Залишайтеся чистими: Танці в близькій відстані вимагають хороших гігієнічних звичок для комфорту всіх.",
    "rules.recommendations.item2": "Будьте обережні: Повідомте свого партнера, якщо ви травмовані або відчуваєте дискомфорт.",
    "rules.recommendations.item3": "Зв'яжіться з нами: Якщо ви відчуваєте дискомфорт або небезпеку, зверніться до організатора. Повідомлення будуть сприйняті серйозно, і переслідування призведе до негайного виключення.",
    "rules.recommendations.item4": "Ви можете закінчити танець у будь-який час, навіть посеред пісні.",
    "rules.recommendations.item5": "Будьте співпрацюючими: Спілкуйтеся та танцюйте з різними людьми, включаючи новачків, і сприяйте створенню привітного досвіду.",
    "rules.recommendations.item6": "Веселіться та знаходьте друзів :)"
  }
}
